[
    {
        "date": "2014-09-15",
        "desc": "This course is designed to help students with very little or no computing background learn the basics of building simple interactive applications.  Our language of choice, Python, is an easy-to learn, high-level computer language that is used in many of the computational courses offered on Coursera.  To make learning Python easy, we have developed a new browser-based programming environment that makes developing interactive applications in Python simple.  These applications will involve windows whose contents are graphical and respond to buttons, the keyboard and the mouse.The primary method for learning the course material will be to work through multiple \"mini-projects\" in Python.  To make this class enjoyable, these projects will include building fun games such as Pong, Blackjack, and Asteroids. When you’ve finished our course, we can’t promise that you will be a professional programmer, but we think that you will learn a lot about programming in Python and have fun while you’re doing it.SyllabusOur course syllabus can be seen atwww.codeskulptor.org/coursera/interactivepython.html.",
        "name": "An Introduction to Interactive Programming in Python",
        "provider": "Coursera",
        "rating": "4.9557142857143",
        "reviews": "2100",
        "university": [
            "Rice University"
        ],
        "url": "https://www.coursera.org/course/interactivepython"
    },
    {
        "date": "2014-09-15",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.本课程的教学内容包括：形式语言与自动机理论、可计算性理论、计算复杂性理论等三个部分。这些内容分别回答下列问题：（1）有哪些计算装置？它们的能力如何？（2）什么是计算？哪些问题是（不）可计算的？（3）什么是有效计算？哪些问题是（不）可有效计算的？通过这门课程的学习，学生将了解计算理论的基础知识，掌握有效计算的概念。本课程的教学方式包括教学录像片段（每段录像8-20分钟，内含1-2个测验问题），教学录像之外的书面作业，以及（必须参加的）期末考试。本课程课程的总长度为8周，每周教学录像长度大约120分钟。需要的预备知识是离散数学（集合论、数理逻辑、图论等）的基本概念。",
        "name": "04830260x: 理论计算机科学基础 | Introduction to Theoretical Computer Science",
        "provider": "edX",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Peking University"
        ],
        "url": "https://www.edx.org/course/li-lun-ji-suan-ji-ke-xue-ji-chu-pekingx-04830260x"
    },
    {
        "date": "2014-09-15",
        "desc": "课程介绍视频可以访问这里。操作系统是计算机系统的基础软件，而系统虚拟化已成为云计算平台的核心技术，没有它们提供的安全性，这些计算机系统及其上数据的安全性都将无法保障。本课程将从理论与工程实践相结合的角度，介绍操作系统(Linux)与系统虚拟化(Xen)安全相关理论、技术和方法，包括：安全概念、安全机制、安全模型、安全体系结构、安全开发方法、安全标准与评测方法等，帮助你深入学习和理解该领域的知识体系、实践技术和方法。这是一门适合本科生、以及研究生的课程，适合计算机、软件工程和信息安全类专业；同时也可供有兴趣的相关研究人员、工程技术人员、管理人员和爱好者等学习和借鉴。课程的内容主要基于教材《操作系统安全设计》（机械工业出版社，2013.9）。该课程是北京大学精品课程，IntelUPO资助的国内首批计算机安全类课程之一.Syllabus第1周. 计算机系统安全的重要性与评测标准第2周. 计算机系统基本安全概念和设计思想第3周. 访问控制机制（自主访问机制，强制访问控制，客体重用）第4周. 可追究机制（标识与鉴别，可信通路，安全审计）第5周. 连续保护机制（I）（最小特权管理， 系统完整性）第6周. 连续保护机制（II）（隐蔽通道分析；可信恢复）第7周. 安全模型（BLP模型，BIBA模型，中国墙模型，RBAC模型与DTE模型）第8周. 安全体系结构（Flask安全体系结构、LSM安全框架，XSM安全框架）第9周. 可信计算技术（访谈卿斯汉教授、王绍斌博士）第10周. 安全操作系统的设计与实现技术案例（访谈卿斯汉教授）第11周. 基于安全操作系统的应用-数据库安全（张敏老师的专题）第12周. 系统虚拟化安全与虚拟可信平台技术",
        "name": "操作系统与虚拟化安全",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Peking University"
        ],
        "url": "https://www.coursera.org/course/osvirtsecurity"
    },
    {
        "date": "2014-09-19",
        "desc": "Ce cours présente des concepts de base de la programmation tels que&nbsp;&nbsp; : variables, expressions, structures de contrôle, fonctions/méthodes, ...en les illustrant dans la syntaxe du langage C++.Ces notions simples seront pratiquées de façon intensive pour vous faire réaliser de façon de plus en plus autonome&nbsp; les étapes allant de la conception d'un programme (algorithme) à sa mise en oeuvre concrète.Ce cours est conçu pour être prolongé par les aspects orienté-objet, présentés dans le cours&nbsp;&nbsp;«Introduction à la programmation orientée objet (en C++)».&nbsp;SyllabusIntroduction à C++Structures de contrôleTableaux, chaînes de caractèresFonctions et réutilisabilitéStructures de donnéesPointeurs et références",
        "name": "Initiation à la programmation (en C++)",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "École Polytechnique Fédérale de Lausanne"
        ],
        "url": "https://www.coursera.org/course/initprogcpp"
    },
    {
        "date": "2014-09-20",
        "desc": "This course forms a strong foundation in the understanding and design of modern computing systems. Building on a computer organization base, this course explores techniques that go into designing a modern microprocessor. Fundamental understanding of computer architecture is key not only for students interested in hardware and processor design, but is a foundation for students interested in compilers, operating systems, and high performance programming. This course will explore how the computer architect can utilize the increasing number of transistors available to improve the performance of a processor. Focus will be given to architectures that can exploit different forms of parallelism, whether they be implicit or explicit. This course covers architectural techniques such as multi-issue superscalar processors, out-of-order processors, Very Long Instruction Word (VLIW) processors, advanced caching, and multiprocessor systems.",
        "name": "Computer Architecture",
        "provider": "Coursera",
        "rating": "5",
        "reviews": "1",
        "university": [
            "Princeton University"
        ],
        "url": "https://www.coursera.org/course/comparch"
    },
    {
        "date": "2014-09-22",
        "desc": "Machine learning is the science of getting computers to act without being\n    explicitly programmed. In the past decade, machine learning has given us\n    self-driving cars, practical speech recognition, effective web search,\n    and a vastly improved understanding of the human genome. Machine learning\n    is so pervasive today that you probably use it dozens of times a day without\n    knowing it. Many researchers also think it is the best way to make progress\n    towards human-level AI. In this class, you will learn about the most effective\n    machine learning techniques, and gain practice implementing them and getting\n    them to work for yourself. More importantly, you'll learn about not only\n    the theoretical underpinnings of learning, but also gain the practical\n    know-how needed to quickly and powerfully apply these techniques to new\n    problems. Finally, you'll learn about some of Silicon Valley's best practices\n    in innovation as it pertains to machine learning and AI.This course provides a broad introduction to machine learning, datamining,\n    and statistical pattern recognition. Topics include: (i) Supervised learning\n    (parametric/non-parametric algorithms, support vector machines, kernels,\n    neural networks). (ii) Unsupervised learning (clustering, dimensionality\n    reduction, recommender systems, deep learning). (iii) Best practices in\n    machine learning (bias/variance theory; innovation process in machine learning\n    and AI). The course will also draw from numerous case studies and applications,\n    so that you'll also learn how to apply learning algorithms to building\n    smart robots (perception, control), text understanding (web search, anti-spam),\n    computer vision, medical informatics, audio, database mining, and other\n    areas.",
        "name": "Machine Learning",
        "provider": "Coursera",
        "rating": "4.7894736842105",
        "reviews": "57",
        "university": [
            "Stanford University"
        ],
        "url": "https://www.coursera.org/course/ml"
    },
    {
        "date": "2014-09-22",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.Louv1.1x (starting Sep. 22, 2014) and Louv1.2x (coming in Nov. 2014) together give an introduction to all major programming concepts, techniques, and paradigms in a unified framework. We cover the three main programming paradigms : functional, object-oriented, and declarative dataflow.The two courses are targeted toward people with a basic knowledge of programming. It will be most useful to beginning programming students, but the unconventional approach should be insightful even to seasoned professionals.Louv1.1x covers fundamental concepts. You’ll learn functional programming, its techniques and its data structures. You’ll use simple formal semantics for all concepts, and see those concepts illustrated with practical code that runs on the accompanying open-source platform, the Mozart Programming System.Louv1.2x covers data abstraction, state, and concurrency. You’ll learn the four ways to do data abstraction and discuss the trade-offs between objects and abstract data types. You’ll be exposed to deterministic dataflow, the most useful paradigm for concurrent programming, and learn how it avoids race conditions.To learn more about the practical organization of the two courses, watch the introductory video.At the end of Louv1.1x and Louv1.2x, the successful participant will be able to :Specify problems, break them down into their basic steps, and design algorithms and abstractions to solve themChoose the right programming paradigm and write a program in this paradigm to solve a problemUse formal semantics to reason about program correctnessWrite small concurrent programs in the deterministic dataflow paradigm",
        "name": "Louv1.1x: Paradigms of Computer Programming – Fundamentals",
        "provider": "edX",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Université catholique de Louvain"
        ],
        "url": "https://www.edx.org/course/paradigms-computer-programming-louvainx-louv1-1x"
    },
    {
        "date": "2014-09-22",
        "desc": "This course provides an overview of the evolving field of cybersecurity, with an introduction to cybersecurity standards and law. Students will learn about common cyber attacks and the techniques for identifying, detecting, and defending against cybersecurity threats. They will also gain a basic understanding of personal, physical, network, web, and wireless security, as well as a foundation for more advanced study of cybersecurity.",
        "name": "Introduction to Cybersecurity",
        "provider": "Canvas.net",
        "rating": "0",
        "reviews": "0",
        "university": [
            "National Cybersecurity Institute at Excelsior College"
        ],
        "url": "https://www.canvas.net/courses/introduction-to-cybersecurity-1"
    },
    {
        "date": "2014-09-22",
        "desc": "”If you are having difficulty viewing this video in mainland China, you can also find it&nbsp;here.课程介绍视频也可以访问中国网站观看。本课程适用于翻译硕士专业研究生、外语专业高年级本科生、翻译工作者以及外语爱好者等。现代语言服务行业要求从业人员必须具有利用计算机及网络来使用各类技术辅助工具帮助其工作的能力，而不是仅仅学会几款狭义的计算机辅助翻译软件。本课程主要讲授计算机辅助翻译技术的基础概念，学习多种计算机辅助翻译工具的使用方法，锻炼学生在技术环境下从事翻译工作等各类语言服务工作的能力，帮助学生理解信息化时代的语言服务工作。课程完整涵盖现代语言服务的基本情况介绍、翻译技术基本概念、语言服务项目执行过程的信息环境与信息技术、如何利用电子辞典、网络资源及语料库工具辅助翻译工作、狭义和广义的计算机辅助翻译工具原理及实战演练、翻译内容质量评定、多人协同翻译项目、翻译管理等多方面的内容。作为翻译类专业学生的必修课程，本课程适合语言类专业学生学习。通过课程的学习，有助于学习者了解现代语言服务行业，增强各类计算机辅助翻译工具的使用技能，提高包括翻译工作在内的各类语言服务工作的效率。该课程是“北大-德稻网络公开课程”中的一门，由北京大学与德稻教育联合提供。本课程同时受到“语言能力协同创新计划”资助和支持。This course is suitable for postgraduate students who major in Translation and Interpreting, undergraduate students majoring in foreign language, translators and language enthusiasts.Those who work in modern language service industry are required to be capable of using computers and Internet to aid their translation job by adapting a variety of efficient tools, rather than just using word processor tools and several basic computer-aided translation software.This course teaches the basic concepts of computer-aided translation technology, helps students learn to use a variety of computer-aided translation tools, enhances their ability to engage in various kinds of language service in such a technical environment, and helps them understand what the modern language service industry looks like.This course covers introduction to modern language services industry, basic principles and concepts of translation technology, information technology used in the process of language translation, how to use electronic dictionaries, Internet resources and corpus tools, practice of different computer-aided translation tools, translation quality assessment, basic concepts of machine translation, globalization, localization and so on. As a compulsory course for students majoring in Translation and Interpreting, this course is also suitable for students with or without language major background. ",
        "name": "计算机辅助翻译原理与实践 Principles and Practice of Computer-Aided Translation",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Peking University"
        ],
        "url": "https://www.coursera.org/course/catmooc"
    },
    {
        "date": "2014-09-22",
        "desc": "How it was never to learn the basics of programming playful.To participate in the course, you do not need special knowledge, only an internet connection and a computer.No special software needs to be installed on the computer.Necessary are only a current browser and an e-mail address with which you can log on openhpi.At the beginning of the free four-week course focuses on simple programming exercises.You learn to control a virtual turtle by your programming.In the following weeks you will be familiarized that will give you a basic understanding of the structure of programming with loops, and functions.In the openhpi course you'll see tutorials and check in the quiz, if you understood everything.Directly in the browser, you can then apply the learned knowledge and program drauflos.If you're stuck once, you can in the forum or the learning groups find support from other students.Upon successful completion you will receive after the course a openhpi certificate.SyllabusWeek 1:Programming and operating instructions.In the first week you will learn how a computer works and how he gets his instructions.Be presented with the programming of the keyboard, formulas, variables, and the turtle (turtle graphics)Week 2:This week you will learn how the computer can handle similar data one by one and itself makes decisions.Presents the conditional statement, loop and lists.Week 3:A major task consists of many small.This week you will learn how programs organized and the same code can be used multiple times.Are presented functions, parameters, and dictionaries.Week 4:Ask the user.In this last week of the course you will learn how the computer can react to user input.Are presented input from keyboard and mouse input, and error handling.",
        "name": "Grundlagen des Programmierens",
        "provider": "openHPI",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.hpi.de/courses/43f44f93-ae42-4141-8b61-ca9dea9dae4d"
    },
    {
        "date": "2014-09-23",
        "desc": "From Google Maps to consumer global positioning system (GPS) devices, spatial technology shapes many lives in both ordinary and extraordinary ways. Thanks to spatial computing, a hiker in Yellowstone and a taxi driver in Manhattan can know precisely where\n    they are, discover nearby points of interest and learn how to reach their destinations. Spatial computing technology is what powers the Foursquare check-in, the maps app on your smartphone, the devices used by scientists to track endangered species,\n    the routing directions that help you get from point A to point B, the precision agriculture technology that is revolutionizing farming, and the augmented reality devices like Google Glass that may soon mediate our interaction with the real world.This course introduces the fundamental ideas underlying spatial computing services, systems, and sciences. Topics covered will include the nature of geospatial information, proper statistical frameworks for working with geospatial data, key algorithms\n    and data structures, spatial data mining, and cartography/geovisualization. We will also address applied topics such as where to find spatial data, how to use powerful open source software to analyze and map spatial data, and frameworks for building\n    location-based services.Three Ways to Enjoy this Course:This course is designed to support three different types of students and educational goals:Curiosity Track: Most of us interact with spatial technologies every day. This track is for students who wish to learn about one or two spatial computing topics, but not commit to an entire course. Curiosity track students are not interested in\n    a certificate of accomplishment.Concepts Track: This track is for students who want to learn about spatial computing concepts in order to make informed choices, but who are not programmers and do not have extensive experience with statistical methods. For example, concepts track\n    students will learn about Tobler’s First Law of ge",
        "name": "From GPS and Google Maps to Spatial Computing",
        "provider": "Coursera",
        "rating": "5",
        "reviews": "1",
        "university": [
            "University of Minnesota"
        ],
        "url": "https://www.coursera.org/course/spatialcomputing"
    },
    {
        "date": "2014-09-23",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.This is the second of a two-part course, and corresponds to the second half of the Computer Programming course CS101 at IIT Bombay. This part begins with a brief review of basic programming concepts, discusses how to handle complex computational applications, and then introduces the basics of object oriented programming. Topics include:PointersStructuresFile processingHandling graphicsIntroduction to Object Oriented Programming ConceptsClasses and MethodsStandard Library of C++.Apart from solving relatively larger and more complex programming problems, participants will get exposure to building a typical programming project.",
        "name": "CS101.2x: Introduction to Computer Programming, Part 2",
        "provider": "edX",
        "rating": "0",
        "reviews": "0",
        "university": [
            "IIT(Indian Institute of Technology Bombay)"
        ],
        "url": "https://www.edx.org/course/introduction-computer-programming-part-2-iitbombayx-cs101-2x"
    },
    {
        "date": "2014-09-23",
        "desc": "Welcome! The instructor has decided to teach the course in Mandarin on Coursera, while the slides of the course will be in English to ease the technical illustrations. We \nhope that this choice can help introduce Machine Learning to more \nbeginners in the Mandarin-speaking world. The English-written slides will not require advanced English ability to understand, though. If you can understand the following descriptions of this course, you can probably follow the slides.[歡迎大家！這門課將採用英文投影片配合華文的教學講解，我們希望能藉這次華文教學的機會，將機器學習介紹給更多華人世界的入門者。課程中使用的英文投影片不會使用到艱深的英文，如果你能了解以下兩段的課程簡介，你應該也可以了解課程所使用的英文投影片。]Machine learning is an exciting field with lots of applications in engineering, science, finance, and commerce. It is also a very dynamic field, where many new techniques are being designed every day, and the hot techniques and theories at times can rise and disappear rapidly. Thus, users of machine learning from other fields often face the problem of choosing or using the techniques properly. In this course, we emphasize the necessary fundamentals that give any student of machine learning a \nsolid foundation, and enable him or her to exploit current techniques properly, explore \nfurther techniques and theories, or perhaps to contribute their own in the future.The course roughly corresponds to the first half-semester of the National Taiwan University course \"Machine Learning\", and the second half-semester is expected to be on Coursera under the name \"Machine Learning Techniques\" soon in the future. Based on five years of teaching this popular course successfully (including winning the most prestigious teaching award of National Taiwan University) and discussing with many other scholars actively, the instructor chooses to focus on what he believes to be the core topics that every student of the subject should know. The students shall enjoy a story-like flow moving from \"When Can Machines Learn\" to \"Why\", \"How\" and beyond.SyllabusEach of the following items correspond to approximately ",
        "name": "機器學習基石 (Machine Learning Foundations)",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "National Taiwan University"
        ],
        "url": "https://www.coursera.org/course/ntumlone"
    },
    {
        "date": "2014-09-25",
        "desc": "All SAP products are moving to SAP HANA, the most talked about SAP innovation in recent times. This evolution intensifies the demands on SAP NetWeaver Application Server ABAP (AS ABAP) to best leverage the features and capabilities of the SAP HANA database. As an ABAP developer you might ask, what is important and necessary to know concerning ABAP development for SAP HANA?This course is aimed at answering this and other related questions. You are welcome to follow the course without prior technical knowledge of ABAP development or SAP HANA, although prior knowledge is beneficial.After completing the course, you will understand the important concepts in ABAP development for SAP HANA, how to detect and analyze the performance of your ABAP coding, and which features AS ABAP provides for database-oriented programming.Registration, learning content, and the final exam are free of charge. However, to gain maximum benefit from the course, you can access a fee-based system environment where you can develop your own code. We&rsquo;ll explain how you can access this system environment in the first week of the course.Course RequirementsBasic knowledge of ABAP programming and Open SQLBasic programming skillsBeneficial: A general understanding of SAP HANA, for example, from the openSAP course&nbsp;\"An Introduction to SAP HANA by Dr. Vishal Sikka\"SyllabusWeek 1: Getting StartedThe first week is dedicated to getting you on board and introducing technical concepts and architecture information, primarily from an ABAP developer&rsquo;s point of view. As well as the important concepts of ABAP development for SAP HANA, there will be an introduction to the development tools.Week 2: ABAP Coding &ndash; Where to Optimize?What happens when you migrate coding to SAP HANA? This and related questions are answered in the second week of this course. There are a large variety of tools available in AS ABAP to detect and analyze ABAP coding, for example, to ensure functional correctness and to ana",
        "name": "ABAP Development for SAP HANA",
        "provider": "openSAP",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.sap.com/course/a4h1"
    },
    {
        "date": "2014-09-25",
        "desc": "This is an introductory course in machine learning (ML) that covers the basic theory, algorithms, and applications. ML is a key technology in Big Data, and in many financial, medical, commercial, and scientific applications. It enables computational systems to automatically learn how to perform a desired task based on information extracted from the data. ML has become one of the hottest fields of study today, taken up by undergraduate and graduate students from 15 different majors at Caltech. This course balances theory and practice, and covers the mathematical as well as the heuristic aspects. The lectures follow each other in a story-like fashion:What is learning?Can a machine learn?How to do it?How to do it well?Take-home lessons.The topics in the story line are covered by 18 lectures of about 60 minutes each plus Q&A.;Lecture 1: The Learning ProblemLecture 2: Is Learning Feasible?Lecture 3: The Linear Model ILecture 4: Error and NoiseLecture 5: Training versus TestingLecture 6: Theory of GeneralizationLecture 7: The VC DimensionLecture 8: Bias-Variance TradeoffLecture 9: The Linear Model IILecture 10: Neural NetworksLecture 11: OverfittingLecture 12: RegularizationLecture 13: ValidationLecture 14: Support Vector MachinesLecture 15: Kernel MethodsLecture 16: Radial Basis FunctionsLecture 17: Three Learning PrinciplesLecture 18: Epilogue",
        "name": "CS1156x: Learning From Data",
        "provider": "edX",
        "rating": "4.2857142857143",
        "reviews": "7",
        "university": [
            "California Institute of Technology"
        ],
        "url": "https://www.edx.org/course/learning-data-caltechx-cs1156x"
    },
    {
        "date": "2014-09-29",
        "desc": "We introduce the student to modern distributed file systems and MapReduce, including what distinguishes good MapReduce algorithms from good algorithms in general. &nbsp;The rest of the course is devoted to algorithms for extracting models and information from large datasets. &nbsp;Students will learn how Google's PageRank algorithm models importance of Web pages and some of the many extensions that have been used for a variety of purposes. &nbsp;We'll cover locality-sensitive hashing, a bit of magic that allows you to find similar items in a set of items so large you cannot possibly compare each pair. &nbsp;When data is stored as a very large, sparse matrix, dimensionality reduction is often a good way to model the data, but standard approaches do not scale well; we'll talk about efficient approaches. &nbsp;Many other large-scale algorithms are covered as well, as outlined in the course syllabus.SyllabusWeek 1:MapReduceLink Analysis -- PageRankWeek 2:Locality-Sensitive Hashing -- Basics + ApplicationsDistance MeasuresNearest NeighborsFrequent ItemsetsWeek 3:Data Stream MiningAnalysis of Large GraphsWeek 4:Recommender SystemsDimensionality ReductionWeek 5:ClusteringComputational AdvertisingWeek 6:Support-Vector MachinesDecision TreesMapReduce AlgorithmsWeek 7:More About Link Analysis -- &nbsp;Topic-specific PageRank, Link Spam.More About Locality-Sensitive Hashing",
        "name": "Mining Massive Datasets",
        "provider": "Coursera",
        "rating": "4",
        "reviews": "1",
        "university": [
            "Stanford University"
        ],
        "url": "https://www.coursera.org/course/mmds"
    },
    {
        "date": "2014-10-01",
        "desc": "Este curso capacita para un primer nivel de desarrollo de aplicaciones m&oacute;viles en HTML5, CSS y JavaScript accesibles desde PC, m&oacute;vil, tableta, SmartTv u otros dispositivos que soporten HTML5. El curso es para principiantes en HTML5 e ilustra los conceptos con ejemplos sencillos y multidisciplinares, tanto de programaci&oacute;n, como de dise&ntilde;o gr&aacute;fico o de dise&ntilde;o de la interacci&oacute;n. Los participantes aprender&aacute;n a dise&ntilde;ar interfaces con HTML y CSS, as&iacute; como a programar en JavaScript nuevas funcionalidades y aplicaciones. Se ense&ntilde;ar&aacute; a crear aplicaciones Web gen&eacute;ricas independientes de dispositivo, as&iacute; como a empaquetarlas para FirefoxOS. Empaquetarlas para Android o iPhone es sencillo, pero no se cubre en este curso.Firefox OS es el nuevo sistema operativo libre para tel&eacute;fonos m&oacute;viles y tabletas de la Fundaci&oacute;n Mozilla, que utiliza software libre y se programa en HTML5, utilizando HTML, CSS y Javascript, igual que las aplicaciones Web de los grandes portales de Internet, Google, Twitter, Facebook, Amazon. etc. Su calidad y car&aacute;cter abierto ha conseguido el apoyo de Telef&oacute;nica, Qualcomm, LG, Huawei Foxconn, etc.Este curso es el primero del programa \"Dise&ntilde;o de servicios en la nube para acceso m&oacute;vil y multi-dispositivo con HTML5 \"impulsado y patrocinado por&nbsp;Red.es,&nbsp;Universia,&nbsp;CENATIC,&nbsp;Telef&oacute;nica Digital&nbsp;y&nbsp;TLS. El programa consta de 5 cursos, que se ir&aacute;n incorporando progresivamente en Mir&iacute;adaX.Esta iniciativa est&aacute; recogida dentro de la medida &ldquo;Formaci&oacute;n para el Empleo&rdquo; del Plan de Inclusi&oacute;n Digital y Empleabilidad de la&nbsp;Agenda Digital para Espa&ntilde;a.&nbsp;Conocimientos necesarios:&nbsp;Si bien el curso ha sido dise&ntilde;ado para principiantes, se recomienda que los asistentes tengan nociones b&aacute;sicas de programaci&oacute;n aunque pued",
        "name": "Desarrollo en HTML5, CSS y Javascript de WebApps, incluyendo móviles FirefoxOS",
        "provider": "Miríada X",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Universidad Politécnica de Madrid"
        ],
        "url": "https://www.miriadax.net/web/html5mooc"
    },
    {
        "date": "2014-10-01",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.Robots today move far too conservatively, using control systems that attempt to maintain full control authority at all times. Humans and animals move much more aggressively by routinely executing motions which involve a loss of instantaneous control authority. Controlling nonlinear systems without complete control authority requires methods that can reason about and exploit the natural dynamics of our machines.This course introduces nonlinear dynamics and control of underactuated mechanical systems, with an emphasis on computational methods. Topics include the nonlinear dynamics of robotic manipulators, applied optimal and robust control and motion planning. Discussions include examples from biology and applications to legged locomotion, compliant manipulation, underwater robots, and flying machines.",
        "name": "6.832x: Underactuated Robotics",
        "provider": "edX",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Massachusetts Institute of Technology"
        ],
        "url": "https://www.edx.org/course/underactuated-robotics-mitx-6-832x"
    },
    {
        "date": "2014-10-02",
        "desc": "Learn many of the concepts that underlie all programming languages. Use functional programming and contrast it with\nobject-oriented programming. Through experience writing programs and studying\nthree different languages, learn the key issues in designing and using\nprogramming languages, such as modularity and the complementary benefits\nof static and dynamic typing. This course is neither particularly theoretical\nnor just about programming specifics – it will give you a framework for\nunderstanding how to use language constructs effectively and how to design\ncorrect and elegant programs. By using different languages, you learn to\nthink more deeply than in terms of the particular syntax of one language.\nThe emphasis on functional programming is essential for learning how to\nwrite robust, reusable, composable, and elegant programs – in any language.Beginning with the Fall 2014 offering, verified certificates are available for this course.  The certificates look slightly different than for courses from other institutions.Here is an example.SyllabusNote: About half the students completing prior offerings report an estimated workload of 8-12\n    hours / week is accurate while most of the other half\n    spent more time -- 15 hours / week or more. Workload naturally differs for different people depending\n    on one's background. Do see the recommended-background section below.Topics (most of which may not mean anything to you until you take the\n    course):Syntax vs. semantics vs. idioms vs. libraries vs. toolsML basics (bindings, conditionals, records, functions)Recursive functions and recursive typesBenefits of no mutationAlgebraic datatypes, pattern matchingTail recursionFirst-class functions and function closuresLexical scopeCurryingSyntactic sugarEquivalence and effectsParametric polymorphism and container typesType inferenceAbstract types and modulesRacket basicsDynamic vs. static typingLaziness, streams, and memoizationImplementing languages, especially higher-order f",
        "name": "Programming Languages",
        "provider": "Coursera",
        "rating": "4.875",
        "reviews": "8",
        "university": [
            "University of Washington"
        ],
        "url": "https://www.coursera.org/course/proglang"
    },
    {
        "date": "2014-10-06",
        "desc": "Organisations around the world are collecting more data than ever. They are talking about big data, data science, business intelligence, analytics, data mining and data visualisation, and there&rsquo;s an urgent need for people with the data skills to understand, interpret and communicate this information.It&rsquo;s all about using statistical data to predict behaviours and extract insights about the real world. From businesses, governments and service organisations to researchers, data has become everybody&rsquo;s business.Data to Insight provides an introduction to statistical data analysis for those new to the subject as well as those wanting a reminder and a fresh perspective.The course focuses on data exploration and discovery, showing you what to look for in statistical data, however large it may be. We&rsquo;ll also teach you some of the limitations of data and what you can do to avoid being misled. We use data visualisations designed to teach you these skills quickly, and introduce you to the basic concepts you need to start understanding our world through data.Our goal is to help you learn to think like a statistician.This course will give you the opportunity to purchase aStatement of Participation.You can use the hashtag&nbsp;#FLdata2insight&nbsp;to join and contribute to social media conversations about this course.&nbsp;REQUIREMENTSThis course assumes very little experience with statistical ideas and concepts. The software you will use is powerful yet simple to use. It is already being used with ease by high school students around New Zealand.You will need to be comfortable thinking in terms of percentages, have basic Microsoft Excel skills, and a Windows or Macintosh computer to download and install our iNZight software.",
        "name": "Data to Insight: An Introduction to Data Analysis",
        "provider": "FutureLearn",
        "rating": "4",
        "reviews": "1",
        "university": [
            "University Of Auckland"
        ],
        "url": "https://www.futurelearn.com/courses/data-to-insight"
    },
    {
        "date": "2014-10-06",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.CS184.1x teaches the Foundations of Computer Graphics. Students will make images of 3D scenes in real-time, and with offline raytracing. This course runs for 6 weeks and consists of four segments. Each segment includes an individual programming assignment:Overview and Basic Math (Homework 0: 10% of grade)Transformations (Homework 1: 20% of grade)OpenGL and Lighting (Homework 2: 35% of grade)Raytracing (Homework 3: 35% of grade)This term, students who earn a total score of 50% or greater will have passed the course and may obtain a free honor code certificate from BerkeleyX.Before your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.",
        "name": "CS-184.1x: Foundations of Computer Graphics",
        "provider": "edX",
        "rating": "0",
        "reviews": "0",
        "university": [
            "University of California, Berkeley"
        ],
        "url": "https://www.edx.org/course/foundations-computer-graphics-uc-berkeleyx-cs184-1x"
    },
    {
        "date": "2014-10-07",
        "desc": "SAP HANA is an in-memory data platform that is deployable either as an appliance or in the cloud. At its core, it is an innovative, in-memory, relational database management system that exploits all the capabilities of current hardware to increase application performance, reduce total cost of ownership, and enable new scenarios and applications that were not possible before.SAP HANA enables you to build applications that integrate the business logic, the control logic, and the database layer with unprecedented performance. As a developer, one of the key issues is how to minimize data movements. The more you can do directly on the data in memory next to the CPUs, the better the application will perform.This course will build upon last year&rsquo;s&nbsp;Introduction to Software Development on SAP HANA&nbsp;course and go deeper into each of the major topics around SAP HANA native development. We will explore the many advances in the programming model and tooling that came with SAP HANA SPS6, SPS7, and SPS8.During the course, we will use SAP HANA studio as well as several new Web-based tools (for example, the Web-based Development Workbench, SAP HANA Lifecycle Management, and SAP HANA XS Administration Tool).We will also go well beyond the basics of each of the programming models, allowing discussion of deeper, real-world patterns and anti-patterns. We will look at the architecture of applications that are not just read-only or analytic but also transactional or provide an interface with transactional systems. We will also look at the extended capabilities of SAP HANA, from beyond a database to a complete application platform.Registration, learning content, final exam, and Record of Achievement are free of charge. However, to fully benefit from the course, you can access a fee-based system environment to develop your own code.Course RequirementsA basic knowledge of database technology, especially relational databases, SQL query language, and JavaScriptA general understa",
        "name": "Next Steps in Software Development on SAP HANA",
        "provider": "openSAP",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.sap.com/courses/hana2"
    },
    {
        "date": "2014-10-08",
        "desc": "随着信息技术及医学影像成像技术的发展，医学图像处理在医学临床、教学和科研中发挥着越来越重要的作用，有力地推动着医学科学研究和临床医疗的进步。如何有效地应用图像增强、分割、配准、融合以及三维重建等数字图像分析与处理技术，对人体解剖结构和病变区域进行定位、提取、三维再现并量化分析是使得医学影像数据应用价值最大化的前提和保证。本课程针对医学图像的特征，结合临床需求，由浅入深地讲解医学图像的种类、特征、应用领域、数字化存储形式，并分类讲解图像处理的理论和算法，结合应用案例和课程实践使学生熟练掌握祥光领域的知识和技能，并具备一定的动手能力，为进一步学习医学图像领域的其他课程奠定基础。The medical image analysis plays an important role in clinical application. The people who want to learn advance theory, algorithms and its applications on the digital image processing area is most suitable. The contents may include image acquiring, image filtering, image segmentation, image understanding and visualization. It could help students to review the history, current status and development of the research area, and could help them to apply them to their own research field. The students are required to understand the basic theory, algorithms and its applications on the digital image processing area.Syllabus第一周 绪论第二周 医学图像基础算法（上）第三周 医学图像基础算法（下）第四章 二值数学形态学第五章 灰度数学形态学第六周 彩色图像和三维图像&nbsp;第七周 图像分割与形状轮廓模型第八周 医学图像配准",
        "name": "医学图像处理技术 Medical Image Analysis",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Shanghai Jiao Tong University"
        ],
        "url": "https://www.coursera.org/course/sjtumia"
    },
    {
        "date": "2014-10-15",
        "desc": "Broadly speaking, functional programming is a style of programming in which the primary method of computation is the application of functions to arguments. Among other features, functional languages offer a compact notation for writing programs, powerful abstraction methods for structuring programs, and a simple mathematical basis that supports reasoning about programs.Functional languages represent the leading edge of programming language design, and the primary setting in which new programming concepts are introduced and studied. All contemporary programming languages such as Hack/PHP, C#, Visual Basic, F#, C++, JavaScript, Python, Ruby, Java, Scala, Clojure, Groovy, Racket, … support higher-order programming via the concept of closures or lambda expressions.This course will use Haskell as the medium for understanding the basic principles of functional programming. While the specific language isn't all that important, Haskell is a pure functional language so it is entirely appropriate for learning the essential ingredients of programming using mathematical functions. It is also a relatively small language, and hence it should be easy for you to get up to speed with Haskell.Once you understand the Why, What and How that underlies pure functional programming and learned to “think like a fundamentalist”, we will apply the concepts of functional programming to “code like a hacker” in mainstream programming languages, using Facebook’s novel Hack language as our main example.This course assumes no prior knowledge of functional programming, but assumes you have at least one year of programming experience in a regular programming language such as Java, .NET, Javascript or PHP.LICENSEThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 3.0 Netherlands License.",
        "name": "FP101x: Introduction to Functional Programming",
        "provider": "edX",
        "rating": "4.6666666666667",
        "reviews": "3",
        "university": [
            "Delft University of Technology"
        ],
        "url": "https://www.edx.org/course/introduction-functional-programming-delftx-fp101x"
    },
    {
        "date": "2014-10-15",
        "desc": "Les r&eacute;seaux sociaux font plus que jamais bouger l&rsquo;organisation du savoir et de l&rsquo;information. Avec la g&eacute;n&eacute;ralisation de la conversation et l&rsquo;arriv&eacute;e de nouveaux m&eacute;dias sociaux, le web vit son deuxi&egrave;me chapitre 2.0. Ce cours introduit &agrave; cette nouvelle donne et r&eacute;sume les directions dans lesquelles la \"mati&egrave;re premi&egrave;re&rdquo; 2.0 est en train d&rsquo;&eacute;voluer...Condens&eacute; d&rsquo;&eacute;clairages sur les enjeux actuels du web participatif, l&rsquo;enseignement propos&eacute; alterne entre objets minuscules (captchas, &laquo; like &raquo;, tags) et des objets immenses, id&eacute;ologiques et &eacute;conomiques (l&rsquo;empowerment, les smart mobs, le Big data). Pour aider &agrave; la prise de d&eacute;cision strat&eacute;gique, le cours est accompagn&eacute; d&rsquo;un ensemble d&rsquo;interviews qui ont &eacute;t&eacute; r&eacute;alis&eacute;es au sein de l&rsquo;&eacute;cosyst&egrave;me de la Silicon Valley, autour de ses th&eacute;matiques principales. Vous pourrez d&eacute;couvrir les analyses des patrons et des analystes fran&ccedil;ais les plus en vue du web social aux Etats-Unis : Freddy Mini (Netvibes), de Dominique Piotet (RebellionLab, essayiste, co-auteur de l&rsquo;Alchimie des Multitudes avec Francis Pisani), de Carlos Diaz (Kwarter et leader du mouvement des Pigeon), de Guillaume Decugis (ScoopIt).Autour du cours, un parcours p&eacute;dagogique clair et complet a &eacute;t&eacute; &eacute;labor&eacute;, offrant de multiples &eacute;valuations, d&eacute;termin&eacute; en fonction du profil de chacun.Pr&eacute;requisAucun pr&eacute;requis sp&eacute;cifique n'est n&eacute;cessaire pour suivre ce cours.",
        "name": "Sociologie du Web : Civilisation 2.0 et Intelligence collective",
        "provider": "IONIS",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://courses.ionisx.com/courses/ionisx/103/p/about"
    },
    {
        "date": "2014-10-16",
        "desc": "Social networks are moving more than ever the organization of knowledge and information.With the spread of the conversation and the arrival of new social media, the web saw his second chapter 2.0.This course introduces to the new situation and summarizes the directions in which the \"raw material\" 2.0 is changing.Condensed light on current issues of the participatory web, the education offered alternate between tiny objects ('like', tag clouds) and huge objects, ideological and economic (empowerment, social Web, the Big data).To assist in strategic decision making, the course is accompanied by a set of interviews that were conducted within the Silicon Valley ecosystem around its main themes.You can explore the different looks for patterns and French analysts the most prominent of the social web in the United States: Freddy Mini (widgets), Dominique Piotet (RebellionLab, essayist, co-author of Alchemy of Hosts with Francis Pisani ), Carlos Diaz (Kwarte and leader of the movement Pigeon), Guillaume Decugis (ScoopIt).Around the course, a clear and comprehensive educational course has been developed with multiple assessments, determined according to the profile of each.",
        "name": "Sociologie du Web : Civilisation 2.0 et Intelligence collective",
        "provider": "IONIS",
        "rating": "0",
        "reviews": "0",
        "university": [
            "IONIS"
        ],
        "url": "https://courses.ionisx.com/courses/ionisx/103/p/about"
    },
    {
        "date": "2014-10-20",
        "desc": "¿Has tenido que resolver un mismo problema varias veces?, por ejemplo, al salir de viaje o preparar una reunión con amigos. Y cada vez, ¿tuviste que volver a pensar en todo lo que hay que hacer, cuáles pasos y en qué orden?Precisamente lo que busca este curso es proporcionarte las herramientas necesarias con las que identificarás, analizarás y plantearás soluciones efectivas para estas situaciones. Así, al encontrarte con el mismo problema, ya sabrás una manera de resolverlo.En este curso introductorio a la computación, desarrollarás el razonamiento estructurado necesario para analizar problemas básicos y resolverlos utilizando la reflexión lógica y el pensamiento algorítmico. De igual manera, reconocerás los elementos que están a tu alcance y cómo los puedes utilizar efectivamente para lograr tus objetivos.Al finalizar el curso, aprenderás a plasmar soluciones en términos computacionales a través de diagramas de flujo o pseudocódigo. Además, podrás trasladar estas soluciones a herramientas como hojas de cálculo que te serán útiles en tus actividades diarias, personales y profesionales.SyllabusSemana 1 - Razonamiento algorítmico y metodología para la solución de problemasAnálisis y solución de problemas empleando algoritmos y diagramas de flujoEntrada y salida de datosExpresiones aritméticas y operador de asignaciónSolución de problemas con expresiones aritméticasSemana 2 - Estructuras de control selectivasProblemas que involucran toma de decisionesEspecificación y funcionamiento de la estructura de control selectivaOperadores relacionales (lógicos)Semana 3 - Estructuras de control repetitivasProblemas que involucran situaciones repetitivasEspecificación de un estatuto de repetición para formar ciclosContador y acumuladorSemana 4 - Aplicación de estructuras cíclicasSolución de problemas utilizando estatutos de repetición simpleSemana 5 - Introducción al ambiente de hoja de cálculoElementos básicos de una hoja de cálculoReferencias absolutas y referencias relativasCr",
        "name": "Pensamiento algorítmico",
        "provider": "Coursera",
        "rating": "5",
        "reviews": "1",
        "university": [
            "Tecnológico de Monterrey"
        ],
        "url": "https://www.coursera.org/course/pealgoritmico"
    },
    {
        "date": "2014-10-20",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.Capturing and analyzing data has changed how decisions are made and resources are allocated in businesses, journalism, government, and military and intelligence fields. Through better use of data, leaders are able to plan and enact strategies with greater clarity and confidence. Data drives increased organizational efficiency and a competitive advantage. Simply, analytics provide new insight and actionable intelligence.In education, the use of data and analytics to improve learning is referred to as learning analytics. Analytics have not yet made the impact on education that they have made in other fields. That’s starting to change. Software companies, researchers, educators, and university leaders recognize the value of data in improving not only teaching and learning, but the entire education sector. In particular, learning analytics enables universities, schools, and corporate training departments to improve the quality of learning and overall competitiveness. Research communities such as the International Educational Data Mining Society (IEDMS) and the Society for Learning Analytics Research (SoLAR) are developing promising models for improving learner success through predictive analytics, machine learning, recommender systems (content and social), network analysis, tracking the development of concepts through social systems, discourse analysis, and intervention and support strategies. The era of data and analytics in learning is just beginning.Data, Analytics, and Learning provides an introduction to learning analytics and how it is being deployed in various contexts in education, including to support automated intervention, to inform instructors, and to pro",
        "name": "LINK5.10x: Data, Analytics and Learning",
        "provider": "edX",
        "rating": "0",
        "reviews": "0",
        "university": [
            "University of Texas Arlington"
        ],
        "url": "https://www.edx.org/course/data-analytics-learning-utarlingtonx-link5-10x"
    },
    {
        "date": "2014-10-20",
        "desc": "El curso \"Data Science en Agricultura\" dotrar&aacute; a los alumnos de los conocimientos esenciales sobre Data Science, de forma que estos puedan ser capaces de avanzar por s&iacute; mismos. La orientaci&oacute;n del curso es hacia el &aacute;mbito de la agricultura, dado que los casos pr&aacute;cticos que se emplear&aacute;n est&aacute;n relacionados con este &aacute;rea. En cualquier caso, no se requiere ning&uacute;n conocimiento espec&iacute;fico sobre agricultura y los conocimientos adquiridos son inmediatamente aplicables a cualquier otro &aacute;rea.Los temas principales ser&aacute;n:La importancia de \"Data Science\". El rol del \"Data Scientist\" y sus habilidades.Las herramientas y fuentes de datos empleadas en \"Data Science\".Casos de estudio: exploratorio, predictivo y descriptivo.El futuro de \"Data Science\".English translation:This course introduces the fundamentals of data science, using agriculture as the common thread. Concepts, tools, methods, processes, and data sources will be explored through lectures, readings, quizzes, and case study applications. Main topics will include:The importance of data scienceSkills and roles of data scientistsData science tools and data sourcesHow to identify and analyze case studiesThe outlook for data science",
        "name": "Data Science en Agricultura",
        "provider": "Canvas.net",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Universidad de Alcalá"
        ],
        "url": "https://www.canvas.net/courses/data-science-en-agricultura"
    },
    {
        "date": "2014-10-20",
        "desc": "This course is anovice-friendly and delightful introductionto computer science and to programming Android apps for smartphones and tablets.No prior programming knowledge is necessary.In this course you will have fun learning tocreate an app for modern Android devices, such as the Nexus tablet.You willuse the programming toolsthat Android software developers use to build your own useful app during this course. Along the way, we will introducefundamental computer science principles and programming ideasthat power today’s smartphone and tablet apps.We will also peek beyond the borders of Android programming to the world of computer science. Meet computer science undergraduates, see one of the firstvacuum tube computers, the firsttransistor, and now-modernscientific researchon the Blue Waters supercomputer—all at Illinois.Android Developer Track: Weeks 1–5(required for passing the course):This portion of the course is intended to give you aslow and gentle introduction to the basicsof Android application development such as downloading, installing, and setting up the tools you will use in this course. You will alsocreate your first Android appand share the results of your experience with your classmates—all while writing hardly any code at all!Computer Science and Programming Track: Weeks 6–8(optional):During this latter portion of the course, you candelve deeper into computer science fundamentalsand beginner programming techniques. Together we will explore this content whiledeveloping another really cool projectto share.SyllabusThis course is composed of 2 tracks organized into 8 distinct weekly topics:Android Developer TrackWeek 1:An App for Hello WorldWeek 2:A Simple App for ILLIACWeek 3:A Working App for ILLIACWeek 4:An App for EmilyWeek 5:A Simple Web App and Debugging Code in 0gComputer Science and Programming TrackWeek 6:An App to Share My ViewsWeek 7:An App for Bitmaps and ImagesWeek 8:An App for Moving Pixels&nbsp;",
        "name": "Creative, Serious and Playful Science of Android Apps",
        "provider": "Coursera",
        "rating": "4.5",
        "reviews": "2",
        "university": [
            "University of Illinois at Urbana-Champaign"
        ],
        "url": "https://www.coursera.org/course/androidapps101"
    },
    {
        "date": "2014-10-20",
        "desc": "The sequencing of the&nbsp;human genome fueled a computational revolution\n    in biology. As a result, modern biology produces as many new&nbsp;algorithms\n    as any other fundamental realm of&nbsp;science. &nbsp;Accordingly, the newly formed&nbsp;links\n    between computer science and biology affect the way we teach applied algorithms to computer\n    scientists.Genome sequencing is just one of hundreds of biological problems that\n    have become inextricable from the computational methods required to solve\n    them. In this course, we will uncover some of the algorithmic ideas\n    that are&nbsp;fundamental to an&nbsp;understanding of modern biology.&nbsp;\n    Computational concepts like dynamic programming and graph theory&nbsp;will\n    help us explore algorithms applied to&nbsp;a wide range of biological topics,\n    from finding regulatory motifs&nbsp;to determining whether the human genome has \"fragile\" regions.&nbsp; Throughout\n    the process, we will apply&nbsp;bioinformatics algorithms to&nbsp;realgenetic\n    data.Each chapter in thecourse textbookcovers a single biological question and slowly builds the algorithmic knowledge required to address this challenge. &nbsp;Along the way, coding challenges and exercises (many of which ask you to apply your skills to real&nbsp;genetic data) will be directly integrated into the text at the exact moment they are needed.SyllabusThe course will be based on six \"chapters\" covering the following central questions, with the algorithmic ideas that we will use to solve them in parentheses:Where Does DNA Replication Begin? (Algorithmic Warm-up)How Do We Sequence Antibiotics? (Brute Force Algorithms)Which DNA Patterns Act As Cellular Clocks? (Greedy and Randomized Algorithms)How Do We Assemble Genomes? (Graph Algorithms)How Do We Compare Biological Sequences? (Dynamic Programming Algorithms)Are There Fragile Regions in the Human Genome? (Combinatorial Algorithms)The grading for the course will be based on several weekly program",
        "name": "Bioinformatics Algorithms (Part 1)",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "University of California, San Diego"
        ],
        "url": "https://www.coursera.org/course/bioinformatics"
    },
    {
        "date": "2014-10-21",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.CS169.1x teaches the fundamentals for engineering long-lasting software using highly-productive Agile techniques to develop Software as a Service (SaaS) using Ruby on Rails. Students will understand the new challenges and opportunities of SaaS versus shrink-wrapped software. They will understand and apply fundamental programming techniques to the design, development, testing, and public cloud deployment of a simple SaaS application. Students will use best-of-breed tools that support modern development techniques including behavior-driven design, user stories, test-driven development, velocity, and pair programming. Students will learn how modern programming language features like metaprogramming and reflection can improve productivity and code maintainability. Students will work on weekly coding projects and quizzes. Those who successfully complete the assignments and earn a passing grade can get an honor code certificate or verified certificate from BerkeleyX. The videos and homeworks used in this offering of the course were revised in October 2013. The new class also includes embedded live chat with Teaching Assistants and other students and opportunities for remote pair programming with other students.Before your course starts, try the new edX Demo where you can explore the fun, interactive learning environment and virtual labs. Learn more.",
        "name": "CS169.1x: Engineering Software as a Service",
        "provider": "edX",
        "rating": "4.75",
        "reviews": "8",
        "university": [
            "University of California, Berkeley"
        ],
        "url": "https://www.edx.org/course/engineering-software-service-uc-berkeleyx-cs169-1x"
    },
    {
        "date": "2014-10-21",
        "desc": "*Note - This is an Archived course*This is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.6.00.2x is aimed at students with some prior programming experience in Python and a rudimentary knowledge of computational complexity. We have chosen to focus on breadth rather than depth. The goal is to provide students with a brief introduction to many topics, so that they will have an idea of what’s possible when the time comes later in their career to think about how to use computation to accomplish some goal. That said, it is not a “computation appreciation” course. Students will spend a considerable amount of time writing programs to implement the concepts covered in the course. Topics covered include plotting, stochastic programs, probability and statistics, random walks, Monte Carlo simulations, modeling data, optimization problems, and clustering.What will I learn? If you successfully complete this course, you will have:Developed some insight into the process of moving from an ambiguous problem statement to a computational formulation of a method for solving the problem,Learned a useful set of algorithmic and problem reduction techniques,Learned how to use simulations to shed light on problems that don’t easily succumb to closed form solutions,Learned how to use computational tools, including simple statistical, machine learning, and plotting tools, to model and understand data.All required readings are available within the courseware, courtesy of The MIT Press. A print version of the course textbook, Introduction to Computer Science and Programming Using Python, is also available for purchase. The MIT Press is offering enrolled students a special 30% discount on books ordered directly through the publisher’s website. To take advantage of this offer, ple",
        "name": "6.00.2x: Introduction to Computational Thinking and Data Science",
        "provider": "edX",
        "rating": "4",
        "reviews": "2",
        "university": [
            "Massachusetts Institute of Technology"
        ],
        "url": "https://www.edx.org/course/introduction-computational-thinking-data-mitx-6-00-2x"
    },
    {
        "date": "2014-10-24",
        "desc": "Présentation et mise en pratique en Java des concepts de base de la programmation orientée objet&nbsp;: objets, classes, méthodes, encapsulation, polymorphisme, ...Bien que nous vous garantissons les bases pour programmer de façon autonomedans le langage Java, ce cours&nbsp; se concentre avant tout sur les concepts de programmation, plutôt que sur les détails du langage lui-même.&nbsp;&nbsp;Ainsi, après avoir suivi ce cours, vous devriez également pouvoirfacilement aborder par vous-mêmes de nouveaux langages deprogrammation.Il est la continuation logique du cours d'introduction&nbsp;«Initiation à la programmation (en Java)».SyllabusIntroduction au concept de «Programmation Orientée Objet»Principes d'encapsulation et d'abstractionHéritagePolymorphismeModificateurs (abstract et final)Interfaces et le modificateur static",
        "name": "Introduction à la programmation orientée objet (en Java)",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "École Polytechnique Fédérale de Lausanne"
        ],
        "url": "https://www.coursera.org/course/intropoojava"
    },
    {
        "date": "2014-10-27",
        "desc": "Ce cours vous fera découvrir différents aspects de la conception d'un programme. Au travers de nombreuses études de cas, nous mettrons en exergue les structures de données et les algorithmes permettant d'apporter des solutions. Comme souvent en informatique, il n'existe pas de solution unique et nous serons amenés à découvrir différentes classes d'algorithme et à les comparer.Nous introduirons à cet effet la notion de complexité d'un programme, c'est à dire à la fois une estimation du temps d'exécution de votre programme et de l'espace requis par celui-ci. Il est tentant de croire que le \"meilleur\" programme est celui qui minimise le temps d'exécution mais très souvent cette complexité est contrainte par la mémoire dont vous disposez. Ainsi, vous n'utiliserez peut-être pas le même algorithme selon que votre programme s'exécute sur un ordinateur ou un téléphone !SyllabusDescription:Ce cours présentera les structures de données les plus classiques comme les  tableaux, listes, piles, files, et arbres pour aller vers les graphes.En parallèle, on découvrira les grands concepts de l'algorithmique à travers des études cas. Nous passerons ainsi en revue les tris, parcours, les arbres de recherche quaternaires,les algorithmes gloutons ainsi que les bases de la programmation dynamique.",
        "name": "Conception et mise en œuvre d'algorithmes.",
        "provider": "Coursera",
        "rating": "5",
        "reviews": "1",
        "university": [
            "École Polytechnique"
        ],
        "url": "https://www.coursera.org/course/algoprog"
    },
    {
        "date": "2014-10-27",
        "desc": "Les microcontrôleurs sont devenus assez simples à mettre en\noeuvre, grâce en particulier à des environnements de développement comme\nl'Arduino. Mais seule une compréhension en profondeur permet de tirer parti au\nmaximum de leur potentiel dans de nombreuses applications, tant dans le cadre\nd'un hobby que dans un cadre industriel.SyllabusRappel d'électricité et électroniqueSystèmes logiques et architectureMachines binairesProgrammation en CEntrées-sortiesApplicationsMise au pointTimers, interruptionsSignaux analogiquesAffichagesCommunicationsRobotique",
        "name": "Comprendre les Microcontrôleurs",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "École Polytechnique Fédérale de Lausanne"
        ],
        "url": "https://www.coursera.org/course/microcontroleurs"
    },
    {
        "date": "2014-10-27",
        "desc": "Die Enth&uuml;llungen durch Edward Snowden haben noch einmal verdeutlicht, dass Sicherheit im Internet ein wichtiges Thema ist. Internetnutzer sind sich eher der vielf&auml;ltigen M&ouml;glichkeiten bewusst, die das Internet bietet, weniger jedoch seiner potentiellen Gefahren. Dieser openHPI-Kurs f&uuml;hrt in die Grundbegriffe der Internetsicherheit ein: Hier lernen Sie nicht nur, was formelle Sicherheitsziele sind sondern auch, warum das Internet von seinem Grunddesign unsicher ist, was die h&auml;ufigsten Schwachstellen sind und wie diese ausgenutzt werden k&ouml;nnen und schlie&szlig;lich auch, wie Sie sich sch&uuml;tzen k&ouml;nnen.",
        "name": "Einführung in die Internetsicherheit",
        "provider": "openHPI",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://openhpi.de/courses/78591fd0-bf4d-4f7f-9e00-2bf71876a3c7"
    },
    {
        "date": "2014-10-27",
        "desc": "Press releases about the theft of sensitive data in unprecedented magnitude clarify again that Internet security is an important issue.Internet users are more likely aware of the many opportunities offered by the network, but less of its potential dangers.This openhpi course introduces the basic concepts of Internet Security: Here you can not only learn what formal security goals are, but also why the Internet is insecure in its basic design.The most common vulnerability of the Internet to demonstrate how this can be exploited and finally, how you can protect yourself.The course first explains basic concepts such as \"vulnerability\", \"attack\" or \"security incident\" and clarifies who attackers on the Internet are, what they do and can thereby underlie the motives.Next, the course examines in week 2 with digital identities and passwords: How to (easily) Passwords can be cracked and how to choose a secure password?In week 3, it then goes to malware (malicious software) - ie viruses, worms and Trojans as well as their connection with the so-called botnets.Continue then in week 4 with the dangers that threaten the insecure transport routes in the open internet: How can attacker might listen to news or even engage in compounds and manipulate the communication?In addition, it comes in this week to protective measures such as firewalls and encryption for the insecure communication channels.The topic of encryption is then absorbed in the weeks 5 and 6 further: First, the course explains the conceptual underpinnings of encryption method and shows following the techniques in practice, eg based on PGP, a commonly used tool for E-mail Security .No special knowledge is required for this course.SyllabusWeek 1:Basic concepts of Internet securityWeek 2:passwords and digital identitiesWeek 3:malware - viruses, worms, Trojans and BotnetsWeek 4:Open Internet, unsafe transportation routesWeek 5:Introduction to EncryptionWeek 6:Encryption in practice",
        "name": "Sicherheit im Internet",
        "provider": "openHPI",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.hpi.de/courses/intsec2014"
    },
    {
        "date": "2014-10-29",
        "desc": "人工智慧可分為強人工智慧及弱人工智慧。強人工智慧著重於模擬人類智能，而弱人工智慧則著重於類似智能的應用表現。達成智能的表現有許多方法，其中一種快速有效的方法即為搜尋，也是這門課的重點。本課程將給予人工智慧一般性的介紹，並且深入探索三種常用的搜尋：不利用問題特性的uninformed search，使用問題特性的informed search，及針對零和對局的adversarial search。課程中除了講解各種搜尋的技術之外，也會同時探討它們的優缺點及應用範圍，使同學易於應用其相關技術。另外，常使用在專家系統中的邏輯也將於此次課程一併介紹。我們會從最基本的證言邏輯開始，進而介紹現實生活中相當實用的一階邏輯，並著重在其中系統性的推論過程，同時我們還會介紹不同推論演算法的特性及它們的能力。最後，將會介紹人工智慧常用的邏輯性語言prolog， 以及它的實作，讓同學們能在本次課程中，對人工智慧領域有更進一步的認識。SyllabusIntroduction &amp; Intelligent agentsUninformed searchInformed searchBeyond classical searchAdversarial searchPropositional LogicFirst Order Logic",
        "name": "人工智慧(Artificial Intelligence)",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "National Taiwan University"
        ],
        "url": "https://www.coursera.org/course/ai"
    },
    {
        "date": "2014-10-29",
        "desc": "SAP Business Intelligence delivers insight into every aspect of your organization by distributing information on premise, on device, and via the cloud. With native integration to SAP HANA, users have the ability to model business scenarios in real-time, adding tremendous value to your business.In this course, you will gain hands-on experience in deploying business intelligence (BI) on SAP HANA, leveraging it both as a data source and as a platform. Learn how SAP BusinessObjects BI 4.1 is optimized for SAP HANA, and explore new features that take advantage of the speed and agility offered by SAP HANA. Benefit from best practices around design, development, and troubleshooting of BI content from SAP&rsquo;s Strategic Customer Engagements (SCE) team. Simplify your SAP BusinessObjects BI toolkit with scenarios that help you select the right client for a particular business need.You will also have the opportunity to experience SAP Lumira in the Desktop, Cloud, and Server releases, to create amazing visualizations that can be consumed anywhere. Take full advantage of the functionality offered in the latest release to update your business intelligence strategy and change the way your organization thinks about BI.The registration, learning content, and final exam are free of charge. As an optional add-on, you will be able to leverage a series of hands-on exercises to reinforce your learning on a trial image for a very reasonable cost, if desired. However, you can complete the course successfully without taking part in the hands-on exercises.Course Requirements:Experience using SAP BI products and client toolsUnderstanding of core database concepts such as SQL, joins, and functionsKnowledge of Web development concepts such as HTML5, JavaScript, and CSS is an advantage, but not essential.SyllabusWeek 1: SAP HANA as an Analytics PlatformWeek 2: Self-ServiceWeek 3: Dashboards and ApplicationsWeek 4: Semantic Layer and ReportingWeek 5: Mobility and CloudWeek 6: User Experience T",
        "name": "BI Clients and Applications on SAP HANA",
        "provider": "openSAP",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.sap.com/courses/bifour2"
    },
    {
        "date": "2014-10-31",
        "desc": "Part II covers graph-processing algorithms, including minimum spanning tree and shortest paths algorithms, and string processing algorithms, including string sorts, tries, substring search, regular expressions, and data compression, and concludes with an overview placing the contents of the course in a larger context.",
        "name": "Algorithms, Part II",
        "provider": "Coursera",
        "rating": "4.8333333333333",
        "reviews": "6",
        "university": [
            "Princeton University"
        ],
        "url": "https://www.coursera.org/course/algs4partII"
    },
    {
        "date": "2014-11-03",
        "desc": "In this course you will learn how to program in Python.We will take the first steps in the language to the study of the most advanced through numerous short videos concepts, exercises and mini-projects.Python has many stores that are already probably what you want.You can create a website with Django, working with databases with SQLAlchemy, developing applications on the Internet with Twisted, make network applications with Scapy, making scientific and symbolic computing with NumPy, SciPy or Sage, and more .However, to fully exploit these libraries you must acquire a deep understanding of language.Python encourages intuitive programming based on a natural syntax and powerful basic concepts that facilitate programming.It is important to master these concepts to quickly write efficient programs are easy to understand and maintain, and that fully exploit the possibilities of language.We will cover in this course all aspects of language, basic types meta-classes, but is structured around three basic concepts that are the strength of Python:the concept of dynamic typing and shared references that provide a fast, easily extensible programming and memory-efficient;the iterator concept that allows a natural and intuitive programming where browse a file is as easy as making a loop over and takes one line of code;the concept of namespace which allows safer programming, minimizing unwanted between different parts of a program interactions.&nbsp;At the end of this Mooc, you will master the fundamentals of the language and you will use them to harness the power of the Python language.Prerequisite:Basic computer: install an application, what is a file system, how to configure a path through a PATH variable, etc.Familiarity with certain mathematical concepts such as variables and functionsLogical loop, condition, basic (and, or, etc.): the concepts of algorithmicGood capacity for abstractionSyllabusWeek 1Introduction and Getting StartedWeek 2Basic typesWeek 3Shared references and ",
        "name": "Python : des fondamentaux à l'utilisation du langage",
        "provider": "France Université Numerique",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Inria (French Institute for Research in Computer Science and Automation)"
        ],
        "url": "https://www.france-universite-numerique-mooc.fr/courses/inria/41001/Trimestre_4_2014/about"
    },
    {
        "date": "2014-11-03",
        "desc": "Yapay Zeka&rsquo;ya Giriş dersinin amacı, s&ouml;z konusu bilim alanının temellerine değinmek ve genel Yapay Zeka yaklaşımları, y&ouml;ntemleri ve tekniklerine dair gerekli bilgi ve becerilerin edinilmesini sağlamaktır. Bu ders sonunda, daha ileri d&uuml;zey Yapay Zeka konularının kavranabilmesi i&ccedil;in gereken her şey &ouml;ğrenilmiş olacaktır. Yapay Zeka konusuna ilgisi olan herkes, Y&uuml;ksek&ouml;ğrenim kurumlarının ilgili b&ouml;l&uuml;mlerinde Yapay Zeka ile ilgili dersler alan &ouml;ğrenciler, Yapay Zeka ile ilgili &ouml;n bilgi sahibi olup, bilgilerini pekiştirmek isteyen herkes bu derse katılabilir.SyllabusYapay Zek&acirc; KavramıYapay Zek&acirc; Problemleri ve Uygulama AlanlarıYapay Zek&acirc; Teknikleri ve SınıflandırmalarGenel Yapay Zek&acirc; Teknikleri ve Y&ouml;ntemleriG&uuml;n&uuml;m&uuml;z Yapay Zek&acirc; &Ccedil;alışmalarında Temel YaklaşımlarDoğa Temelli Yaklaşım",
        "name": "Yapay Zeka'ya Giriş",
        "provider": "Universiteplus",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Uşak Üniversitesi"
        ],
        "url": "https://www.universiteplus.com/courses/yapay-zeka-ya-giris"
    },
    {
        "date": "2014-11-04",
        "desc": "En este curso aprender&aacute;s lo b&aacute;sico del desarrollo de aplicaciones m&oacute;viles para Android, ser&aacute; un curso introductorio cubriendo los conceptos b&aacute;sicos que te permitir&aacute; crear tus primeras aplicaciones y publicarlas a Google Play.&nbsp;\"Desarrollo de Aplicaciones para Android\" ser&aacute; un curso altamente pr&aacute;ctico con demos y tareas de c&oacute;digo semanales. Requiere que el estudiante conozca el paradigma de programaci&oacute;n orientada a objetos y de preferencia el lenguaje de programaci&oacute;n Java.&nbsp;Syllabus&nbsp;Introducci&oacute;n a AndroidLayouts y elementos de interfaz gr&aacute;ficaBloques b&aacute;sicos de aplicaci&oacute;nLayouts y elementos de interfaz gr&aacute;ficaAlmacenamiento y datosAcceso a hardwarePublicaci&oacute;n de apps- See more at: http://telescopio.galileo.edu/curso/desarrollo-de-aplicaciones-para-android/#sthash.xsKBpY3b.dpuf&nbsp;",
        "name": "Desarrollo de Aplicaciones para Android",
        "provider": "Independent",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Galileo University"
        ],
        "url": "http://telescopio.galileo.edu/curso/desarrollo-de-aplicaciones-para-android/"
    },
    {
        "date": "2014-11-06",
        "desc": "In this course, we will begin by studying why the video game fascinates product marketing.We'll dissect the behavior of the players to understand their motivations to play for tens or hundreds of hours in the same game.It will consider the implementation of gamification with case studies of services that you will surely use it, and you did not know they were gamifi&eacute;s.Finally, we will end up an ethical debate about the difference between motivation and manipulation, and how to avoid falling to the dark side of the force (although there, they have cookies).PrerequisitesRecommended:Good knowledge of marketingGood knowledge of the ecosystem of applications (mobile and web)",
        "name": "Gamifier son service",
        "provider": "IONIS",
        "rating": "0",
        "reviews": "0",
        "university": [
            "IONIS"
        ],
        "url": "https://courses.ionisx.com/courses/ionisx/105/p/about"
    },
    {
        "date": "2014-11-11",
        "desc": "Congratulations! You&rsquo;ve made it through the Introduction and Next Steps in SAP HANA Cloud Platform, and now it&rsquo;s time to move to the next level. You&rsquo;ve already been introduced to SAP HANA Cloud Platform, and have explored some of the advanced features and services that the platform provides.This course will show you another perspective - putting SAP HANA Cloud Platform into good use for extending various SAP products. You'll learn about some of the extension options that SAP products support, and explore the required technologies and tools that will help you to be productive. As part of the course, you&rsquo;ll create your first extension to SuccessFactors, as well as experiment with different collaboration options in SAP Jam.To follow all the units, you should have completed the openSAP courses&nbsp;Introduction to SAP HANA Cloud Platform&nbsp;and&nbsp;Next Steps in SAP HANA Cloud Platform.The course content assumes that you&rsquo;re already familiar with the concepts and technologies introduced there. Registration, learning content, required systems, and the final exam are free of charge to all participants.Target AudienceApplication developersSAP partnersCourse RequirementsParticipation in the openSAP course&nbsp;Introduction to SAP HANA Cloud PlatformParticipation in the openSAP course&nbsp;Next Steps in SAP HANA Cloud PlatformBasic programming skillsBasic knowledge of how to use an Eclipse development environmentSyllabusWeek 1:Extending SAP Cloud ProductsWeek 2:Cloud Extension in DetailsWeek 3:My First SuccessFactors ExtensionWeek 4:My First SAP Jam ExtensionI Like, I Wish:We Love Your Feedback &hellip; And Want MoreFinal Exam:Good Luck!",
        "name": "Extending SAP Products with SAP HANA Cloud Platform",
        "provider": "openSAP",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.sap.com/courses/hanacloud3"
    },
    {
        "date": "2014-11-12",
        "desc": "Data scienceis the profession of the\nfuture, because organizations that are unable to use (big) data in a smart way\nwill not survive. It is not sufficient to focus on data storage and data\nanalysis. The data scientist also needs to relate data to process analysis.Process\nmining bridges the gap between traditional model-based process analysis (e.g.,\nsimulation and other business process management techniques) and data-centric\nanalysis techniques such as machine learning and data mining.Process mining\nseeks the confrontation between event data (i.e., observed behavior) and\nprocess models (hand-made or discovered automatically). This technology has\nbecome available only recently, but it can be applied to any type of operational\nprocesses (organizations and systems). Example applications include: analyzing\ntreatment processes in hospitals, improving customer service processes in a\nmultinational, understanding the browsing behavior of customers using a booking\nsite, analyzing failures of a baggage handling system, and improving the user\ninterface of an X-ray machine. All of these applications have in common that\ndynamic behavior needs to be related to process models. Hence, we refer to this\nas \"data science in action\".The course explains the key analysis\ntechniques in process mining. Participants will learn various process discovery\nalgorithms. These can be used to automatically learn process models from raw\nevent data. Various other process analysis techniques that use event data will\nbe presented. Moreover, the course will provideeasy-to-use software,real-life\ndata sets, andpractical skillstodirectly apply the theoryin a variety of\napplication domains.SyllabusThis course starts with an overview\nof approaches and technologies that use event data to support decision making\nand business process (re)design. Then the course focuses onprocess mining as a\nbridge between data mining and business process modeling. The course is at an\nintroductory level with various practical as",
        "name": "Process Mining: Data science in Action",
        "provider": "Coursera",
        "rating": "0",
        "reviews": "0",
        "university": [
            "Eindhoven University of Technology"
        ],
        "url": "https://www.coursera.org/course/procmin"
    },
    {
        "date": "2014-11-13",
        "desc": "SAP Business Warehouse (BW) continues to serve as a powerful data warehouse to consolidate data, harmonize master data and provide flexible reporting scenarios. Introducing SAP HANA as database underneath SAP BW was a major breakthrough in various core areas for data warehousing. With the combination of a rich data warehousing application and a fast in-memory database, we&rsquo;ve seen architectural simplification, performance improvements and new modelling experiences.The course will introduce the renewed concepts and possibilities when SAP BW is powered by SAP HANA. We&rsquo;ll introduce the major guiding points and semantics of a data warehouse and demonstrate them in a business scenario, directly in the system. You will learn and experience the latest developments, with SAP BW 7.4 powered by SAP HANA, as well as opportunities for real-time data integration and agile data modelling. We will demonstrate what it means to consume the data via a data warehouse and show you how SAP HANA helps to speed up data analysis. We&rsquo;ll also introduce the planning capabilities based on SAP BW, which is a unique combination of reporting and planning on the same platform.The registration, learning content, final exam, and the Record of Achievement are free of charge.Target AudienceConsultantsImplementation expertsArchitectsDevelopersCourse RequirementsA basic understanding of data warehousingIt is preferable to have pre-basic SAP BW knowledge.You should have already walked through the openSAP course&nbsp;ABAP Development for SAP HANA, since some concepts will be shared and further developed.SyllabusWeek 1:SAP BW powered by SAP HANA &ndash; IntroWeek 2:Data Integration &amp; ManagementWeek 3:Data Consumption &amp; AnalysisWeek 4:Planning &amp; Lifecycle ManagementI Like, I Wish:We Love Your Feedback &hellip; And Want MoreFinal Exam:Good Luck!",
        "name": "SAP Business Warehouse powered by SAP HANA",
        "provider": "openSAP",
        "rating": "0",
        "reviews": "0",
        "university": [],
        "url": "https://open.sap.com/courses/bwhana1"
    }
]