[
    {
        "description": "The course presents an in-depth interdisciplinary perspective of electric power systems, with regulation providing the link among the engineering, economic, legal and environmental viewpoints. Generation dispatch, demand response, optimal network flows, risk allocation, reliability of service, renewable energy sources, ancillary services, tariff design, distributed generation, rural electrification, environmental impacts and strategic sustainability issues will be among the topics addressed under both traditional and competitive regulatory frameworks.",
        "features": "Selected lecture notes, Assignments (no solutions)",
        "id": "esd-934-engineering-economics-and-regulation-of-the-electric-power-sector-spring-2010",
        "instructors": "Prof. Ignacio Perez-Arriaga",
        "level": "Graduate",
        "mcn": "ESD.934",
        "sem": "Spring 2010",
        "thumb": "/courses/engineering-systems-division/esd-934-engineering-economics-and-regulation-of-the-electric-power-sector-spring-2010/esd-934s10-th.jpg",
        "title": "Engineering, Economics and Regulation of the Electric Power Sector"
    },
    {
        "description": "Traditionally, progress in electronics has been driven by miniaturization. But as electronic devices approach the molecular scale, classical models for device behavior must be abandoned. To prepare for the next generation of electronic devices, this class teaches the theory of current, voltage and resistance from atoms up. To describe electrons at the nanoscale, we will begin with an introduction to the principles of quantum mechanics, including quantization, the wave-particle duality, wavefunctions and Schrödinger's equation. Then we will consider the electronic properties of molecules, carbon nanotubes and crystals, including energy band formation and the origin of metals, insulators and semiconductors. Electron conduction will be taught beginning with ballistic transport and concluding with a derivation of Ohm's law. We will then compare ballistic to bulk MOSFETs. The class will conclude with a discussion of possible fundamental limits to computation.",
        "features": "Online textbooks, Assignments (no solutions), Exams (no solutions)",
        "id": "6-701-introduction-to-nanoelectronics-spring-2010",
        "instructors": "Prof. Marc  Baldo",
        "level": "Undergraduate",
        "mcn": "6.701",
        "sem": "Spring 2010",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-701-introduction-to-nanoelectronics-spring-2010/6-701s10-th.jpg",
        "title": "Introduction to Nanoelectronics"
    },
    {
        "description": "6.720 examines the physics of microelectronic semiconductor devices for silicon integrated circuit applications. Topics covered include: semiconductor fundamentals, p-n junction, metal-oxide semiconductor structure, metal-semiconductor junction, MOS field-effect transistor, and bipolar junction transistor. The course emphasizes physical understanding of device operation through energy band diagrams and short-channel MOSFET device design. Issues in modern device scaling are also outlined. The course is worth 2 Engineering Design Points.\r\nAcknowledgments\r\nProf. Jesús del Alamo would like to thank Prof. Harry Tuller for his support of and help in teaching the course.",
        "features": "Lecture notes, Projects (no examples), Assignments (no solutions), Exams (no solutions)",
        "id": "6-720j-integrated-microelectronic-devices-spring-2007",
        "instructors": "Prof. Jesús del Alamo",
        "level": "Graduate",
        "mcn": "6.720J",
        "sem": "Spring 2007",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-720j-integrated-microelectronic-devices-spring-2007/6-720js07-th.jpg",
        "title": "Integrated Microelectronic Devices"
    },
    {
        "description": "\n6.728 is offered under the department's \"Devices, Circuits, and Systems\" concentration. The course covers concepts in elementary quantum mechanics and statistical physics, introduces applied quantum physics, and emphasizes an experimental basis for quantum mechanics. Concepts covered include: Schrodinger's equation applied to the free particle, tunneling, the harmonic oscillator, and hydrogen atom, variational methods, Fermi-Dirac, Bose-Einstein, and Boltzmann distribution functions, and simple models for metals, semiconductors, and devices such as electron microscopes, scanning tunneling microscope, thermonic emitters, atomic force microscope, and others.",
        "features": "Assignments (no solutions), Exams (no solutions)",
        "id": "6-728-applied-quantum-and-statistical-physics-fall-2006",
        "instructors": "Prof. Terry Orlando",
        "level": "Graduate",
        "mcn": "6.728",
        "sem": "Fall 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-728-applied-quantum-and-statistical-physics-fall-2006/6-728f06-th.jpg",
        "title": "Applied Quantum and Statistical Physics"
    },
    {
        "description": "\nThis course examines classical and quantum models of electrons and lattice vibrations in solids, emphasizing physical models for elastic properties, electronic transport, and heat capacity. Topics covered include: crystal lattices, electronic energy band structures, phonon dispersion relatons, effective mass theorem, semiclassical equations of motion, and impurity states in semiconductors, band structure and transport properties of selected semiconductors, and connection of quantum theory of solids with quasifermi levels and Boltzmann transport used in device modeling.",
        "features": "Lecture notes, Projects and examples",
        "id": "6-730-physics-for-solid-state-applications-spring-2003",
        "instructors": "Prof. Rajeev Ram, Prof. Terry Orlando",
        "level": "Graduate",
        "mcn": "6.730",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-730-physics-for-solid-state-applications-spring-2003/6-73s03-th.jpg",
        "title": "Physics for Solid-State Applications"
    },
    {
        "description": "\nThis course provides a phenomenological approach to superconductivity, with emphasis on superconducting electronics. Topics include: electrodynamics of superconductors, London's model, flux quantization, Josephson Junctions, superconducting quantum devices, equivalent circuits, high-speed superconducting electronics, and quantized circuits for quantum computing. The course also provides an overview of type II superconductors, critical magnetic fields, pinning, the critical state model, superconducting materials, and microscopic theory of superconductivity.",
        "features": "Selected lecture notes",
        "id": "6-763-applied-superconductivity-fall-2005",
        "instructors": "Prof. Terry Orlando",
        "level": "Graduate",
        "mcn": "6.763",
        "sem": "Fall 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-763-applied-superconductivity-fall-2005/6-763f05-th.jpg",
        "title": "Applied Superconductivity"
    },
    {
        "description": "This course outlines the physics, modeling, application, and technology of compound semiconductors (primarily III-Vs) in electronic, optoelectronic, and photonic devices and integrated circuits. Topics include: properties, preparation, and processing of compound semiconductors; theory and practice of heterojunctions, quantum structures, and pseudomorphic strained layers; metal-semiconductor field effect transistors (MESFETs); heterojunction field effect transistors (HFETs) and bipolar transistors (HBTs); photodiodes, vertical-and in-plane-cavity laser diodes, and other optoelectronic devices.",
        "features": "Selected lecture notes, Projects and examples",
        "id": "6-772-compound-semiconductor-devices-spring-2003",
        "instructors": "Prof. Clifton Fonstad, Jr.",
        "level": "Graduate",
        "mcn": "6.772",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-772-compound-semiconductor-devices-spring-2003/6-772s03-th.jpg",
        "title": "Compound Semiconductor Devices"
    },
    {
        "description": "\nThis course is offered to graduates and focuses on understanding the fundamental principles of the \"front-end\" processes used in the fabrication of devices for silicon integrated circuits. This includes advanced physical models and practical aspects of major processes, such as oxidation, diffusion, ion implantation, and epitaxy. Other topics covered include: high performance MOS and bipolar devices including ultra-thin gate oxides, implant-damage enhanced diffusion, advanced metrology, and new materials such as Silicon Germanium (SiGe).",
        "features": "Audio lectures",
        "id": "6-774-physics-of-microfabrication-front-end-processing-fall-2004",
        "instructors": "Prof. Judy Hoyt, Prof. L. Rafael Reif<br/>(Contributor)",
        "level": "Graduate",
        "mcn": "6.774",
        "sem": "Fall 2004",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-774-physics-of-microfabrication-front-end-processing-fall-2004/6-774f04-th.jpg",
        "title": "Physics of Microfabrication: Front End Processing"
    },
    {
        "description": "6.776 covers circuit level design issues of high speed communication systems, with primary focus being placed on wireless and broadband data link applications. Specific circuit topics include transmission lines, high speed and low noise amplifiers, VCO's, mixers, power amps, high speed digital circuits, and frequency synthesizers. In addition to learning analysis skills for the above items, students will gain a significant amount of experience in simulating RF circuits in SPICE and also building RF circuits within a lab project.",
        "features": "Selected lecture notes, Assignments (no solutions), Exams (no solutions)",
        "id": "6-776-high-speed-communication-circuits-spring-2005",
        "instructors": "Prof. Hae-Seung Lee, Prof. Michael Perrott",
        "level": "Graduate",
        "mcn": "6.776",
        "sem": "Spring 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-776-high-speed-communication-circuits-spring-2005/6-776s05-th.jpg",
        "title": "High Speed Communication Circuits"
    },
    {
        "description": "\n6.777J / 2.372J is an introduction to microsystem design. Topics covered include: material properties, microfabrication technologies, structural behavior, sensing methods, fluid flow, microscale transport, noise, and amplifiers feedback systems. Student teams design microsystems (sensors, actuators, and sensing/control systems) of a variety of types, (e.g., optical MEMS, bioMEMS, inertial sensors) to meet a set of performance specifications (e.g., sensitivity, signal-to-noise) using a realistic microfabrication process. There is an emphasis on modeling and simulation in the design process. Prior fabrication experience is desirable. The course is worth 4 Engineering Design Points. ",
        "features": "Lecture notes, Projects (no examples), Assignments and solutions, Images on Flickr",
        "id": "6-777j-design-and-fabrication-of-microelectromechanical-devices-spring-2007",
        "instructors": "Prof. Carol Livermore, Prof. Joel Voldman",
        "level": "Graduate",
        "mcn": "6.777J",
        "sem": "Spring 2007",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-777j-design-and-fabrication-of-microelectromechanical-devices-spring-2007/6-777js07-th.jpg",
        "title": "Design and Fabrication of Microelectromechanical Devices"
    },
    {
        "description": "\n6.780 covers statistical modeling and the control of semiconductor fabrication processes and plants. Topics covered include: design of experiments, response surface modeling, and process optimization; defect and parametric yield modeling; process/device/circuit yield optimization; monitoring, diagnosis, and feedback control of equipment and processes; and analysis and scheduling of semiconductor manufacturing operations.",
        "features": "Selected lecture notes, Projects (no examples), Assignments and solutions, Exams (no solutions)",
        "id": "6-780-semiconductor-manufacturing-spring-2003",
        "instructors": "Prof. Duane Boning",
        "level": "Graduate",
        "mcn": "6.780",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-780-semiconductor-manufacturing-spring-2003/6-780s03-th.jpg",
        "title": "Semiconductor Manufacturing"
    },
    {
        "description": "\nThis course explores statistical modeling and control in manufacturing processes. Topics include the use of experimental design and response surface modeling to understand manufacturing process physics, as well as defect and parametric yield modeling and optimization. Various forms of process control, including statistical process control, run by run and adaptive control, and real-time feedback control, are covered. Application contexts include semiconductor manufacturing, conventional metal and polymer processing, and emerging micro-nano manufacturing processes.",
        "features": "Video lectures, Demonstration - video, Lecture notes, Assignments and solutions, Exams and solutions",
        "id": "2-830j-control-of-manufacturing-processes-sma-6303-spring-2008",
        "instructors": "Prof. David Hardt, Prof. Duane Boning",
        "level": "Graduate",
        "mcn": "2.830J",
        "sem": "Spring 2008",
        "thumb": "/courses/mechanical-engineering/2-830j-control-of-manufacturing-processes-sma-6303-spring-2008/2-830js08-th.jpg",
        "title": "Control of Manufacturing Processes (SMA 6303)"
    },
    {
        "description": "This course surveys techniques to fabricate and analyze submicron and nanometer structures, with applications. Optical and electron microscopy is reviewed. Additional topics that are covered include: surface characterization, preparation, and measurement techniques, resist technology, optical projection, interferometric, X-ray, ion, and electron lithography; Aqueous, ion, and plasma etching techniques; lift-off and electroplating; and ion implantation. Applications in microelectronics, microphotonics, information storage, and nanotechnology will also be explored.AcknowledgementsThe Instructors would like to thank Bob Barsotti, Bryan Cord, and Ben Wunsch for their work on the Atomic Force Microscope video. They would also like to thank Bryan Cord for creating each video.",
        "features": "Demonstration - video",
        "id": "6-781j-submicrometer-and-nanometer-technology-spring-2006",
        "instructors": "Prof. George Barbastathis, Prof. Henry Smith, Prof. Karl Berggren",
        "level": "Graduate",
        "mcn": "6.781J",
        "sem": "Spring 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-781j-submicrometer-and-nanometer-technology-spring-2006/6-781js06-th.jpg",
        "title": "Submicrometer and Nanometer Technology"
    },
    {
        "description": "\n6.821 teaches the principles of functional, imperative, and logic programming languages. Topics covered include: meta-circular interpreters, semantics (operational and denotational), type systems (polymorphism, inference, and abstract types), object oriented programming, modules, and multiprocessing. The course involves substantial programming assignments and problem sets as well as a significant amount of reading. The course uses the Scheme+ programming language for all of its assignments.",
        "features": "Assignments and solutions, Exams (no solutions)",
        "id": "6-821-programming-languages-fall-2002",
        "instructors": "Prof. Michael Ernst",
        "level": "Graduate",
        "mcn": "6.821",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-821-programming-languages-fall-2002/6-821f02-th.jpg",
        "title": "Programming Languages"
    },
    {
        "description": "\n6.823 is a course in the department's \"Computer Systems and Architecture\" concentration. 6.823 is a study of the evolution of computer architecture and the factors influencing the design of hardware and software elements of computer systems. Topics may include: instruction set design; processor micro-architecture and pipelining; cache and virtual memory organizations; protection and sharing; I/O and interrupts; in-order and out-of-order superscalar architectures; VLIW machines; vector supercomputers; multithreaded architectures; symmetric multiprocessors; and parallel computers.",
        "features": "Lecture notes, Assignments (no solutions), Exams (no solutions)",
        "id": "6-823-computer-system-architecture-fall-2005",
        "instructors": "Dr. Joel Emer, Prof. Krste Asanovic, Prof.  Arvind<br/>(Lecturer)",
        "level": "Graduate",
        "mcn": "6.823",
        "sem": "Fall 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-823-computer-system-architecture-fall-2005/6-823f05-th.jpg",
        "title": "Computer System Architecture"
    },
    {
        "description": "\nThis course covers abstractions and implementation techniques for the design of distributed systems. Topics include: server design, network programming, naming, storage systems, security, and fault tolerance. The assigned readings for the course are from current literature. This course is worth 6 Engineering Design Points. ",
        "features": "Selected lecture notes, Exams (no solutions)",
        "id": "6-824-distributed-computer-systems-engineering-spring-2006",
        "instructors": "Prof. Robert Morris",
        "level": "Graduate",
        "mcn": "6.824",
        "sem": "Spring 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-824-distributed-computer-systems-engineering-spring-2006/6-824s06-th.jpg",
        "title": "Distributed Computer Systems Engineering"
    },
    {
        "description": "\n6.825 is a graduate-level introduction to artificial intelligence. Topics covered include: representation and inference in first-order logic, modern deterministic and decision-theoretic planning techniques, basic supervised learning methods, and Bayesian network inference and learning.\nThis course was also taught as part of the Singapore-MIT Alliance (SMA) programme as course number SMA 5504 (Techniques in Artificial Intelligence).",
        "features": "Selected lecture notes, Assignments and solutions",
        "id": "6-825-techniques-in-artificial-intelligence-sma-5504-fall-2002",
        "instructors": "Prof. Tomás Lozano-Pérez, Prof. Leslie Kaelbling",
        "level": "Graduate",
        "mcn": "6.825",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-825-techniques-in-artificial-intelligence-sma-5504-fall-2002/6-825f02-th.jpg",
        "title": "Techniques in Artificial Intelligence (SMA 5504)"
    },
    {
        "description": "\n6.826 provides an introduction to the basic principles of computer systems, with emphasis on the use of rigorous techniques as an aid to understanding and building modern computing systems. Particular attention is paid to concurrent and distributed systems. Topics covered include: specification and verification, concurrent algorithms, synchronization, naming, networking, replication techniques (including distributed cache management), and principles and algorithms for achieving reliability.",
        "features": "Lecture notes",
        "id": "6-826-principles-of-computer-systems-spring-2002",
        "instructors": "Prof. Butler Lampson, Prof. Martin Rinard",
        "level": "Graduate",
        "mcn": "6.826",
        "sem": "Spring 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-826-principles-of-computer-systems-spring-2002/6-826s02-th.jpg",
        "title": "Principles of Computer Systems"
    },
    {
        "description": "\nThe topics covered in this course include:\n\n Languages and compilers to exploit multithreaded parallelism\n Implicit parallel programming using functional languages and their extensions\n Higher-order functions, non-strictness, and polymorphism\n Explicit parallel programming and nondeterminism\n The lambda calculus and its variants\n Term rewriting and operational semantics\n Compiling multithreaded code for symmetric multiprocessors and clusters\n Static analysis and compiler optimizations\n\nThis course is worth 4 Engineering Design Points.",
        "features": "Lecture notes, Projects (no examples), Assignments (no solutions), Exams (no solutions)",
        "id": "6-827-multithreaded-parallelism-languages-and-compilers-fall-2002",
        "instructors": "Prof.  Arvind",
        "level": "Graduate",
        "mcn": "6.827",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-827-multithreaded-parallelism-languages-and-compilers-fall-2002/6-827f02-th.jpg",
        "title": "Multithreaded Parallelism: Languages and Compilers"
    },
    {
        "description": "This course studies fundamental design and implementation ideas in the engineering of operating systems. Lectures are based on a study of UNIX and research papers. Topics include virtual memory, threads, context switches, kernels, interrupts, system calls, interprocess communication, coordination, and the interaction between software and hardware. Individual laboratory assignments involve implementation of a small operating system in C, with some x86 assembly.",
        "features": "Lecture notes, Projects and examples, Assignments (no solutions), Exams and solutions",
        "id": "6-828-operating-system-engineering-fall-2012",
        "instructors": "Prof. Frans Kaashoek",
        "level": "Graduate",
        "mcn": "6.828",
        "sem": "Fall 2012",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-828-operating-system-engineering-fall-2012/6-828f12-th.jpg",
        "title": "Operating System Engineering"
    },
    {
        "description": "\nHow does the global network infrastructure work and what are the design principles on which it is based? In what ways are these design principles compromised in practice? How do we make it work better in today's world? How do we ensure that it will work well in the future in the face of rapidly growing scale and heterogeneity? And how should Internet applications be written, so they can obtain the best possible performance both for themselves and for others using the infrastructure? These are some issues that are grappled with in this course. The course will focus on the design, implementation, analysis, and evaluation of large-scale networked systems. \nTopics&nbsp;include internetworking philosophies, unicast and multicast routing, congestion control, network quality of service, mobile networking, router architectures, network-aware applications, content dissemination systems, network security, and performance issues.&nbsp;Material&nbsp;for the course will be drawn from research papers, industry white papers, and&nbsp;Internet RFCs.",
        "features": "Selected lecture notes",
        "id": "6-829-computer-networks-fall-2002",
        "instructors": "Prof. Hari Balakrishnan",
        "level": "Graduate",
        "mcn": "6.829",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-829-computer-networks-fall-2002/6-829f02-th.jpg",
        "title": "Computer Networks"
    },
    {
        "description": "Robots today move far too conservatively, using control systems that attempt to maintain full control authority at all times. Humans and animals move much more aggressively by routinely executing motions which involve a loss of instantaneous control authority. Controlling nonlinear systems without complete control authority requires methods that can reason about and exploit the natural dynamics of our machines. This course discusses nonlinear dynamics and control of underactuated mechanical systems, with an emphasis on machine learning methods. Topics include nonlinear dynamics of passive robots (walkers, swimmers, flyers), motion planning, partial feedback linearization, energy-shaping control, analytical optimal control, reinforcement learning/approximate optimal control, and the influence of mechanical design on control. Discussions include examples from biology and applications to legged locomotion, compliant manipulation, underwater robots, and flying machines. Acknowledgements Professor Tedrake would like to thank John Roberts for his help with the course and videotaping the lectures.",
        "features": "Video lectures, Projects (no examples), Assignments (no solutions), Exams (no solutions)",
        "id": "6-832-underactuated-robotics-spring-2009",
        "instructors": "Prof. Russell Tedrake",
        "level": "Graduate",
        "mcn": "6.832",
        "sem": "Spring 2009",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-832-underactuated-robotics-spring-2009/6-832s09-th.jpg",
        "title": "Underactuated Robotics"
    },
    {
        "description": "6.803/6.833 is a course in the department's &quot;Artifical Intelligence and Applications&quot; concentration. This course is offered both to undergraduates (6.803) and graduates (6.833). 6.803/6.833 is designed to help students learn about progress toward the scientific goal of understanding human intelligence from a computational point of view. This course complements 6.034, because 6.803/6.833 focuses on long-standing scientific questions, whereas 6.034 focuses on existing tools for building applications with reasoning and learning capability. The content of 6.803/6.833 is largely based on papers by representative Artificial Intelligence leaders, which serve as the basis for discussion and assignments for the course.",
        "features": "Projects (no examples)",
        "id": "6-803-the-human-intelligence-enterprise-spring-2006",
        "instructors": "Prof. Patrick Henry Winston",
        "level": "Undergraduate",
        "mcn": "6.803",
        "sem": "Spring 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-803-the-human-intelligence-enterprise-spring-2006/6-803s06-th.jpg",
        "title": "The Human Intelligence Enterprise"
    },
    {
        "description": "\nThis course is offered both to undergraduates (6.803) and graduates (6.833) and is designed to help students learn about progress toward the scientific goal of understanding human intelligence from a computational point of view. This course complements 6.034, because it focuses on long-standing scientific questions, whereas 6.034 focuses on existing tools for building applications with reasoning and learning capability.\nThe content of 6.803/6.833 is largely based on papers by representative Artificial Intelligence leaders, which serve as the basis for discussion and assignments for the course.",
        "features": "Projects (no examples)",
        "id": "6-803-the-human-intelligence-enterprise-spring-2002",
        "instructors": "Prof. Patrick Henry Winston",
        "level": "Undergraduate",
        "mcn": "6.803",
        "sem": "Spring 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-803-the-human-intelligence-enterprise-spring-2002/6-803s02-th.jpg",
        "title": "The Human Intelligence Enterprise"
    },
    {
        "description": "\nCognitive robotics addresses the emerging field of autonomous systems possessing artificial reasoning skills. Successfully-applied algorithms and autonomy models form the basis for study, and provide students an opportunity to design such a system as part of their class project. Theory and application are linked through discussion of real systems such as the Mars Exploration Rover.",
        "features": "Selected lecture notes, Projects and examples",
        "id": "16-412j-cognitive-robotics-spring-2005",
        "instructors": "Prof. Brian Williams",
        "level": "Graduate",
        "mcn": "16.412J",
        "sem": "Spring 2005",
        "thumb": "/courses/aeronautics-and-astronautics/16-412j-cognitive-robotics-spring-2005/16-412js05-th.jpg",
        "title": "Cognitive Robotics"
    },
    {
        "description": "\nAnimation is a compelling and effective form of expression; it engages viewers and makes difficult concepts easier to grasp. Today's animation industry creates films, special effects, and games with stunning visual detail and quality. This graduate class will investigate the algorithms that make these animations possible: keyframing, inverse kinematics, physical simulation, optimization, optimal control, motion capture, and data-driven methods. Our study will also reveal the shortcomings of these sophisticated tools. The students will propose improvements and explore new methods for computer animation in semester-long research projects. The course should appeal to both students with general interest in computer graphics and students interested in new applications of machine learning, robotics, biomechanics, physics, applied mathematics and scientific computing.",
        "features": "",
        "id": "6-838-algorithms-for-computer-animation-fall-2002",
        "instructors": "Prof. Jovan Popovic",
        "level": "Graduate",
        "mcn": "6.838",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-838-algorithms-for-computer-animation-fall-2002/6-838f02-th.jpg",
        "title": "Algorithms for Computer Animation"
    },
    {
        "description": "This graduate level course is more extensive and theoretical treatment of the material in Computability, and Complexity (6.045J / 18.400J). Topics include Automata and Language Theory, Computability Theory, and Complexity Theory.",
        "features": "Exams (no solutions)",
        "id": "18-404j-theory-of-computation-fall-2006",
        "instructors": "Prof. Michael Sipser",
        "level": "Graduate",
        "mcn": "18.404J",
        "sem": "Fall 2006",
        "thumb": "/courses/mathematics/18-404j-theory-of-computation-fall-2006/18-404jf06-th.jpg",
        "title": "Theory of Computation"
    },
    {
        "description": "\nThe topics for this course&#160;cover various aspects of complexity theory, such as&#160; the basic time and space classes, the polynomial-time hierarchy and the randomized classes . This is a pure theory class, so no applications were involved.",
        "features": "Lecture notes",
        "id": "18-405j-advanced-complexity-theory-fall-2001",
        "instructors": "Prof. Daniel Spielman",
        "level": "Graduate",
        "mcn": "18.405J",
        "sem": "Fall 2001",
        "thumb": "/courses/mathematics/18-405j-advanced-complexity-theory-fall-2001/18-405jf01-th.jpg",
        "title": "Advanced Complexity Theory"
    },
    {
        "description": "\n6.844 is a graduate introduction to programming theory, logic of programming, and computability, with the programming language Scheme used to crystallize computability constructions and as an object of study itself. Topics covered include: programming and computability theory based on a term-rewriting, \"substitution\" model of computation by Scheme programs with side-effects; computation as algebraic manipulation: Scheme evaluation as algebraic manipulation and term rewriting theory; paradoxes from self-application and introduction to formal programming semantics; undecidability of the Halting Problem for Scheme; properties of recursively enumerable sets, leading to Incompleteness Theorems for Scheme equivalences; logic for program specification and verification; and Hilbert's Tenth Problem.",
        "features": "",
        "id": "6-844-computability-theory-of-and-with-scheme-spring-2003",
        "instructors": "Prof. Albert R. Meyer",
        "level": "Graduate",
        "mcn": "6.844",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-844-computability-theory-of-and-with-scheme-spring-2003/6-844s03-th.jpg",
        "title": "Computability Theory of and with Scheme"
    },
    {
        "description": "This course is an introduction to quantum computational complexity theory, the study of the fundamental capabilities and limitations of quantum computers. Topics include complexity classes, lower bounds, communication complexity, proofs, advice, and interactive proof systems in the quantum world. The objective is to bring students to the research frontier.",
        "features": "Lecture notes, Projects (no examples), Assignments (no solutions)",
        "id": "6-845-quantum-complexity-theory-fall-2010",
        "instructors": "Prof. Scott Aaronson",
        "level": "Graduate",
        "mcn": "6.845",
        "sem": "Fall 2010",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-845-quantum-complexity-theory-fall-2010/6-845f10-th.jpg",
        "title": "Quantum Complexity Theory"
    },
    {
        "description": "This course focuses on the algorithms for analyzing and designing geometric foldings. Topics include reconfiguration of foldable structures, linkages made from one-dimensional rods connected by hinges, folding two-dimensional paper (origami), and unfolding and folding three-dimensional polyhedra. Applications to architecture, robotics, manufacturing, and biology are also covered in this course. Acknowledgments Thanks to videographers Martin Demaine and Jayson Lynch.",
        "features": "Video lectures, Subtitles/transcript, Projects (no examples), Assignments and solutions, Instructor insights, This Course at MIT",
        "id": "6-849-geometric-folding-algorithms-linkages-origami-polyhedra-fall-2012",
        "instructors": "Prof. Erik Demaine",
        "level": "Graduate",
        "mcn": "6.849",
        "sem": "Fall 2012",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-849-geometric-folding-algorithms-linkages-origami-polyhedra-fall-2012/6-849f12-th.jpg",
        "title": "Geometric Folding Algorithms: Linkages, Origami, Polyhedra"
    },
    {
        "description": "Data structures play a central role in modern computer science. You interact with data structures even more often than with algorithms (think Google, your mail server, and even your network routers). In addition, data structures are essential building blocks in obtaining efficient algorithms. This course covers major results and current directions of research in data structure. Acknowledgments Thanks to videographers Martin Demaine and Justin Zhang.",
        "features": "Video lectures, Lecture notes, Assignments and solutions, Instructor insights, This Course at MIT",
        "id": "6-851-advanced-data-structures-spring-2012",
        "instructors": "Prof. Erik Demaine",
        "level": "Graduate",
        "mcn": "6.851",
        "sem": "Spring 2012",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-851-advanced-data-structures-spring-2012/6-851s12-th.jpg",
        "title": "Advanced Data Structures"
    },
    {
        "description": "Distributed algorithms are algorithms designed to run on multiple processors, without tight centralized control. In general, they are harder to design and harder to understand than single-processor sequential algorithms. Distributed algorithms are used in many practical systems, ranging from large computer networks to multiprocessor shared-memory systems. They also have a rich theory, which forms the subject matter for this course.\r\nThe core of the material will consist of basic distributed algorithms and impossibility results, as covered in Prof. Lynch's book Distributed Algorithms. This will be supplemented by some updated material on topics such as self-stabilization, wait-free computability, and failure detectors, and some new material on scalable shared-memory concurrent programming.",
        "features": "Lecture notes, Assignments (no solutions)",
        "id": "6-852j-distributed-algorithms-fall-2009",
        "instructors": "Prof. Nancy Lynch",
        "level": "Graduate",
        "mcn": "6.852J",
        "sem": "Fall 2009",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-852j-distributed-algorithms-fall-2009/6-852jf09-th.jpg",
        "title": "Distributed Algorithms"
    },
    {
        "description": "\nThis is a graduate course on the design and analysis of algorithms, covering several advanced topics not studied in typical introductory courses on algorithms. It is especially designed for doctoral students interested in theoretical computer science.",
        "features": "Selected lecture notes",
        "id": "6-854j-advanced-algorithms-fall-2008",
        "instructors": "Prof. Michel Goemans",
        "level": "Graduate",
        "mcn": "6.854J",
        "sem": "Fall 2008",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2008/6-854jf08-th.jpg",
        "title": "Advanced Algorithms"
    },
    {
        "description": "\nThis course is a first-year graduate course in algorithms. Emphasis is placed on fundamental algorithms and advanced methods of algorithmic design, analysis, and implementation. Techniques to be covered include amortization, randomization, fingerprinting, word-level parallelism, bit scaling, dynamic programming, network flow, linear programming, fixed-parameter algorithms, and approximation algorithms. Domains include string algorithms, network optimization, parallel algorithms, computational geometry, online algorithms, external memory, cache, and streaming algorithms, and data structures.",
        "features": "",
        "id": "6-854j-advanced-algorithms-fall-2005",
        "instructors": "Prof. David R. Karger",
        "level": "Graduate",
        "mcn": "6.854J",
        "sem": "Fall 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-854j-advanced-algorithms-fall-2005/6-854jf05-th.jpg",
        "title": "Advanced Algorithms"
    },
    {
        "description": "15.082J/6.855J/ESD.78J is a graduate subject in the theory and practice of network flows and its extensions. Network flow problems form a subclass of linear programming problems with applications to transportation, logistics, manufacturing, computer science, project management, and finance, as well as a number of other domains. This subject will survey some of the applications of network flows and focus on key special cases of network flow problems including the following: the shortest path problem, the maximum flow problem, the minimum cost flow problem, and the multi-commodity flow problem. We will also consider other extensions of network flow problems.",
        "features": "Lecture notes, Projects (no examples), Assignments (no solutions)",
        "id": "15-082j-network-optimization-fall-2010",
        "instructors": "Prof. James Orlin",
        "level": "Graduate",
        "mcn": "15.082J",
        "sem": "Fall 2010",
        "thumb": "/courses/sloan-school-of-management/15-082j-network-optimization-fall-2010/15-082jf10-th.jpg",
        "title": "Network Optimization"
    },
    {
        "description": "\nThis course examines how randomization can be used to make algorithms simpler and more efficient via random sampling, random selection of witnesses, symmetry breaking, and Markov chains. Topics covered include: randomized computation; data structures (hash tables, skip lists); graph algorithms (minimum spanning trees, shortest paths, minimum cuts); geometric algorithms (convex hulls, linear programming in fixed or arbitrary dimension); approximate counting; parallel algorithms; online algorithms; derandomization techniques; and tools for probabilistic analysis of algorithms.",
        "features": "Selected lecture notes",
        "id": "6-856j-randomized-algorithms-fall-2002",
        "instructors": "Prof. David R. Karger",
        "level": "Graduate",
        "mcn": "6.856J",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-856j-randomized-algorithms-fall-2002/6-856jf02-th.jpg",
        "title": "Randomized Algorithms"
    },
    {
        "description": "6.857 Network and Computer Security&nbsp;is an upper-level undergraduate, first-year graduate course on network and computer security. It fits within the Computer Systems and Architecture Engineering concentration.",
        "features": "Lecture notes, Projects (no examples), Assignments and solutions",
        "id": "6-857-network-and-computer-security-spring-2014",
        "instructors": "Prof. Ronald Rivest",
        "level": "Graduate",
        "mcn": "6.857",
        "sem": "Spring 2014",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-857-network-and-computer-security-spring-2014/6-857s14-th.jpg",
        "title": "Network and Computer Security"
    },
    {
        "description": "The course is a comprehensive introduction to the theory, algorithms and applications of integer optimization and is organized in four parts: formulations and relaxations, algebra and geometry of integer optimization, algorithms for integer optimization, and extensions of integer optimization.",
        "features": "Lecture notes, Assignments (no solutions), Exams (no solutions)",
        "id": "15-083j-integer-programming-and-combinatorial-optimization-fall-2009",
        "instructors": "Prof. Dimitris Bertsimas, Prof. Andreas Schulz",
        "level": "Graduate",
        "mcn": "15.083J",
        "sem": "Fall 2009",
        "thumb": "/courses/sloan-school-of-management/15-083j-integer-programming-and-combinatorial-optimization-fall-2009/15-083jf09-th.jpg",
        "title": "Integer Programming and Combinatorial Optimization"
    },
    {
        "description": "\n6.863 is a laboratory-oriented course on the theory and practice of building computer systems for human language processing, with an emphasis on the linguistic, cognitive, and engineering foundations for understanding their design.",
        "features": "Selected lecture notes",
        "id": "6-863j-natural-language-and-the-computer-representation-of-knowledge-spring-2003",
        "instructors": "Prof. Robert Berwick",
        "level": "Graduate",
        "mcn": "6.863J",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-863j-natural-language-and-the-computer-representation-of-knowledge-spring-2003/6-863js03-th.jpg",
        "title": "Natural Language and the Computer Representation of Knowledge"
    },
    {
        "description": "\nThis course is a graduate introduction to natural language processing - the study of human language from a computational perspective. It covers syntactic, semantic and discourse processing models, emphasizing machine learning or corpus-based methods and algorithms. It also covers applications of these methods and models in syntactic parsing, information extraction, statistical machine translation, dialogue systems, and summarization. The subject qualifies as an Artificial Intelligence and Applications concentration subject.",
        "features": "Lecture notes",
        "id": "6-864-advanced-natural-language-processing-fall-2005",
        "instructors": "Prof. Michael Collins, Prof. Regina Barzilay",
        "level": "Graduate",
        "mcn": "6.864",
        "sem": "Fall 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-864-advanced-natural-language-processing-fall-2005/6-864f05-th.jpg",
        "title": "Advanced Natural Language Processing"
    },
    {
        "description": "\nMachine Vision provides an intensive introduction to the process of generating a symbolic description of an environment from an image. Lectures describe the physics of image formation, motion vision, and recovering shapes from shading. Binary image processing and filtering are presented as preprocessing steps. Further topics include photogrammetry, object representation alignment, analog VLSI and computational vision. Applications to robotics and intelligent machine interaction are discussed.",
        "features": "Lecture notes, Exams and solutions",
        "id": "6-801-machine-vision-fall-2004",
        "instructors": "Prof. Berthold Horn",
        "level": "Undergraduate",
        "mcn": "6.801",
        "sem": "Fall 2004",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-801-machine-vision-fall-2004/6-801f04-th.jpg",
        "title": "Machine Vision"
    },
    {
        "description": "\n6.867 is an introductory course on machine learning which gives an overview of many concepts, techniques, and algorithms in machine learning, beginning with topics such as classification and linear regression and ending up with more recent topics such as boosting, support vector machines, hidden Markov models, and Bayesian networks. The course will give the student the basic ideas and intuition behind modern machine learning methods as well as a bit more formal understanding of how, why, and when they work. The underlying theme in the course is statistical inference as it provides the foundation for most of the methods covered. ",
        "features": "Lecture notes, Assignments and solutions, Exams and solutions",
        "id": "6-867-machine-learning-fall-2006",
        "instructors": " Rohit Singh<br/>(Teaching Assistant), Prof. Tommi Jaakkola,  Ali Mohammad<br/>(Teaching Assistant)",
        "level": "Graduate",
        "mcn": "6.867",
        "sem": "Fall 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-867-machine-learning-fall-2006/6-867f06-th.jpg",
        "title": "Machine Learning"
    },
    {
        "description": "This course is an introduction to the theory that tries to explain how minds are made from collections of simpler processes. It treats such aspects of thinking as vision, language, learning, reasoning, memory, consciousness, ideals, emotions, and personality. It incorporates ideas from psychology, artificial intelligence, and computer science to resolve theoretical issues such as wholes vs. parts, structural vs. functional descriptions, declarative vs. procedural representations, symbolic vs. connectionist models, and logical vs. common-sense theories of learning.",
        "features": "Video lectures, Assignments (no solutions)",
        "id": "6-868j-the-society-of-mind-fall-2011",
        "instructors": "Prof. Marvin Minsky",
        "level": "Graduate",
        "mcn": "6.868J",
        "sem": "Fall 2011",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-868j-the-society-of-mind-fall-2011/6-868jf11-th.jpg",
        "title": "The Society of Mind"
    },
    {
        "description": "\nThis course covers the development of programs containing a significant amount of knowledge about their application domain. The course includes a brief review of relevant AI techniques; case studies from a number of application domains, chosen to illustrate principles of system development; a discussion of technical issues encountered in building a system, including selection of knowledge representation, knowledge acquisition, etc.; and a discussion of current and future research. The course also provides hands-on experience in building an expert system (term project). ",
        "features": "Selected lecture notes, Projects and examples",
        "id": "6-871-knowledge-based-applications-systems-spring-2005",
        "instructors": "Prof. Randall Davis",
        "level": "Graduate",
        "mcn": "6.871",
        "sem": "Spring 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-871-knowledge-based-applications-systems-spring-2005/6-871s05-th.jpg",
        "title": "Knowledge-Based Applications Systems"
    },
    {
        "description": "Analyzes computational needs of clinical medicine reviews systems and approaches that have been used to support those needs, and the relationship between clinical data and gene and protein measurements. Topics: the nature of clinical data; architecture and design of healthcare information systems; privacy and security issues; medical expertsystems; introduction to bioinformatics. Case studies and guest lectures describe contemporary systems and research projects. Term project using large clinical and genomic data sets integrates classroom topics.",
        "features": "Selected lecture notes, Assignments (no solutions)",
        "id": "hst-950j-biomedical-computing-fall-2010",
        "instructors": "Prof. Peter Szolovits, Prof. Gil Alterovitz",
        "level": "Graduate",
        "mcn": "HST.950J",
        "sem": "Fall 2010",
        "thumb": "/courses/health-sciences-and-technology/hst-950j-biomedical-computing-fall-2010/hst-950jf10-th.jpg",
        "title": "Biomedical Computing"
    },
    {
        "description": "\nThe focus of the course is on medical science and practice in the age of automation and the genome, both present and future. \nIt ncludes an analysis of the computational needs of clinical medicine, a review systems and approaches that have been used to support those needs, and an examination of new technologies.",
        "features": "Selected lecture notes",
        "id": "hst-950j-medical-computing-spring-2003",
        "instructors": "Prof. Isaac Kohane, Prof. Lucila Ohno-Machado, Prof. Peter Szolovits",
        "level": "Graduate",
        "mcn": "HST.950J",
        "sem": "Spring 2003",
        "thumb": "/courses/health-sciences-and-technology/hst-950j-medical-computing-spring-2003/hst-950js03-th.jpg",
        "title": "Medical Computing"
    },
    {
        "description": "\nThis course presents the main concepts of decision analysis, artificial intelligence, and predictive model construction and evaluation in the specific context of medical applications. The advantages and disadvantages of using these methods in real-world systems&nbsp;are emphasized, while students gain hands-on experience with application specific methods. The technical focus of the course includes decision analysis, knowledge-based systems (qualitative and quantitative), learning systems (including logistic regression, classification trees, neural networks), and techniques to evaluate the performance of such systems.",
        "features": "Selected lecture notes, Projects and examples",
        "id": "hst-951j-medical-decision-support-fall-2005",
        "instructors": "Prof. Lucila Ohno-Machado, Prof. Staal Vinterbo",
        "level": "Graduate",
        "mcn": "HST.951J",
        "sem": "Fall 2005",
        "thumb": "/courses/health-sciences-and-technology/hst-951j-medical-decision-support-fall-2005/hst-951jf05-th.jpg",
        "title": "Medical Decision Support"
    },
    {
        "description": "\nThis course presents the main concepts of decision analysis, artificial intelligence and predictive model construction and evaluation in the specific context of medical applications. It emphasizes the advantages and disadvantages of using these methods in real-world systems and provides hands-on experience. Its technical focus is on decision support, knowledge-based systems (qualitative and quantitative), learning systems (including logistic regression, classification trees, neural networks, rough sets), and techniques to evaluate the performance of such systems. It reviews computer-based diagnosis, planning and monitoring of therapeutic interventions. It also discusses implemented medical applications and the software tools used in their construction. Students produce a final project using the machine learning methods learned in the course, based on actual clinical data.\nLecturers\n\n\nProf. Stephan Dreiseitl\nProf. Ju Jan Kim\nProf. Bill Long\n\n\nProf. Marco Ramoni\nProf. Fred Resnic\nProf. David Wypij\n\n\n",
        "features": "Selected lecture notes, Assignments and solutions, Exams (no solutions)",
        "id": "hst-951j-medical-decision-support-spring-2003",
        "instructors": "Prof. Isaac Kohane, Prof. Lucila Ohno-Machado, Prof. Peter Szolovits, Prof. Staal Vinterbo",
        "level": "Graduate",
        "mcn": "HST.951J",
        "sem": "Spring 2003",
        "thumb": "/courses/health-sciences-and-technology/hst-951j-medical-decision-support-spring-2003/hst-951js03-th.jpg",
        "title": "Medical Decision Support"
    },
    {
        "description": "\nThe course focuses on casting contemporary problems in systems biology and functional genomics in computational terms and providing appropriate tools and methods to solve them. Topics include genome structure and function, transcriptional regulation, and stem cell biology in particular; measurement technologies such as microarrays (expression, protein-DNA interactions, chromatin structure); statistical data analysis, predictive and causal inference, and experiment design. The emphasis is on coupling problem structures (biological questions) with appropriate computational approaches.",
        "features": "Selected lecture notes, Projects and examples",
        "id": "7-90j-computational-functional-genomics-spring-2005",
        "instructors": "Prof. David Gifford, Prof. Tommi Jaakkola",
        "level": "Graduate",
        "mcn": "7.90J",
        "sem": "Spring 2005",
        "thumb": "/courses/biology/7-90j-computational-functional-genomics-spring-2005/7-90js05-th.jpg",
        "title": "Computational Functional Genomics"
    },
    {
        "description": "\nThis course features a rigorous introduction to modern cryptography, with an emphasis on the fundamental cryptographic primitives of public-key encryption, digital signatures, pseudo-random number generation, and basic protocols and their computational complexity requirements.",
        "features": "",
        "id": "6-875-cryptography-and-cryptanalysis-spring-2005",
        "instructors": "",
        "level": "Graduate",
        "mcn": "6.875",
        "sem": "Spring 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-875-cryptography-and-cryptanalysis-spring-2005/6-875s05-th.jpg",
        "title": "Cryptography and Cryptanalysis"
    },
    {
        "description": "\nThe topics covered in this course include interactive proofs, zero-knowledge proofs, zero-knowledge proofs of knowledge, non-interactive zero-knowledge proofs, secure protocols, two-party secure computation, multiparty secure computation, and chosen-ciphertext security.",
        "features": "Lecture notes",
        "id": "6-876j-advanced-topics-in-cryptography-spring-2003",
        "instructors": "",
        "level": "Graduate",
        "mcn": "6.876J",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-876j-advanced-topics-in-cryptography-spring-2003/6-876js03-th.jpg",
        "title": "Advanced Topics in Cryptography"
    },
    {
        "description": "\nWhy has it been easier to develop a vaccine to eliminate polio than to control influenza or AIDS? Has there been natural selection for a 'language gene'? Why are there no animals with wheels? When does 'maximizing fitness' lead to evolutionary extinction? How are sex and parasites related? Why don't snakes eat grass? Why don't we have eyes in the back of our heads? How does modern genomics illustrate and challenge the field? \nThis course analyzes evolution from a computational, modeling, and engineering perspective. The course has extensive hands-on laboratory exercises in model-building and analyzing evolutionary data.",
        "features": "Selected lecture notes",
        "id": "6-877j-computational-evolutionary-biology-fall-2005",
        "instructors": "Prof. Robert Berwick",
        "level": "Graduate",
        "mcn": "6.877J",
        "sem": "Fall 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-877j-computational-evolutionary-biology-fall-2005/6-877jf05-th.jpg",
        "title": "Computational Evolutionary Biology"
    },
    {
        "description": "\nThis course focuses on the algorithmic and machine learning foundations of computational biology, combining theory with practice. We study the principles of algorithm design for biological datasets, and analyze influential problems and techniques. We use these to analyze real datasets from large-scale studies in genomics and proteomics. The topics covered include:\n\nGenomes: biological sequence analysis, hidden Markov models, gene finding, RNA folding, sequence alignment, genome assembly\nNetworks: gene expression analysis, regulatory motifs, graph algorithms, scale-free networks, network motifs, network evolution\nEvolution: comparative genomics, phylogenetics, genome duplication, genome rearrangements, evolutionary theory, rapid evolution\n",
        "features": "Selected lecture notes, Projects (no examples), Assignments (no solutions), Exams (no solutions)",
        "id": "6-047-computational-biology-genomes-networks-evolution-fall-2008",
        "instructors": "Prof. Manolis Kellis, Prof. James Galagan",
        "level": "Undergraduate",
        "mcn": "6.047",
        "sem": "Fall 2008",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-047-computational-biology-genomes-networks-evolution-fall-2008/6-047f08-th.jpg",
        "title": "Computational Biology: Genomes, Networks, Evolution"
    },
    {
        "description": "\nMost algorithms in computer vision and image analysis can be understood in terms of two important components: a representation and a modeling/estimation algorithm. The representation defines what information is important about the objects and is used to describe them. The modeling techniques extract the information from images to instantiate the representation for the particular objects present in the scene. In this seminar, we will discuss popular representations (such as contours, level sets, deformation fields) and useful methods that allow us to extract and manipulate image information, including manifold fitting, markov random fields, expectation maximization, clustering and others. \nFor each concept -- a new representation or an estimation algorithm -- a lecture on the mathematical foundations of the concept will be followed by a discussion of two or three relevant research papers in computer vision, medical and biological imaging, that use the concept in different ways. We will aim to understand the fundamental techniques and to recognize situations in which these techniques promise to improve the quality of the analysis.",
        "features": "Selected lecture notes, Projects and examples",
        "id": "6-881-representation-and-modeling-for-image-analysis-spring-2005",
        "instructors": "Prof. Polina Golland",
        "level": "Graduate",
        "mcn": "6.881",
        "sem": "Spring 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-881-representation-and-modeling-for-image-analysis-spring-2005/6-881s05-th.jpg",
        "title": "Representation and Modeling for Image Analysis"
    },
    {
        "description": "\nThis course is broad, covering a wide range of topics that have to do with the post-pc era of computing. It is a hands-on project course that also includes some foundational subjects. Students will program iPAQ handheld computers, cell phones (series 60 phones), speech processing, vision, Cricket location systems, GPS, and more. Most of the programming will be using Python&reg;, but Python&reg; can be learned and mastered during the course.\nThis course was also taught as part of the Singapore-MIT Alliance (SMA) programme as course number SMA 5508 (Pervasive Computing).",
        "features": "Selected lecture notes, Exams (no solutions)",
        "id": "6-883-pervasive-human-centric-computing-sma-5508-spring-2006",
        "instructors": "Dr. Larry Rudolph",
        "level": "Graduate",
        "mcn": "6.883",
        "sem": "Spring 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-883-pervasive-human-centric-computing-sma-5508-spring-2006/6-883s06-th.jpg",
        "title": "Pervasive Human Centric Computing (SMA 5508)"
    },
    {
        "description": "\n6.883 is a graduate seminar that investigates a variety of program analysis techniques that address software engineering tasks. Static analysis topics include abstract interpretation (dataflow), type systems, model checking, decision procedures (SAT, BDDs), theorem-proving. Dynamic analysis topics include testing, fault isolation (debugging), model inference, and visualization. While the course focuses on the design and implementation of programming tools, the material will be useful to anyone who wishes to improve his or her programming or understand the state of the art. Students are expected to read classic and current technical papers, actively participate in class discussion, perform small exercises that provide experience with a variety of tools, and complete a team research project.",
        "features": "Projects and examples",
        "id": "6-883-program-analysis-fall-2005",
        "instructors": "Prof. Michael Ernst",
        "level": "Graduate",
        "mcn": "6.883",
        "sem": "Fall 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-883-program-analysis-fall-2005/6-883f05-th.jpg",
        "title": "Program Analysis"
    },
    {
        "description": "\nThis course is offered to graduates and is a project-oriented course to teach new methodologies for designing multi-million-gate CMOS VLSI chips using high-level synthesis tools in conjunction with standard commercial EDA tools. The emphasis is on modular and robust designs, reusable modules, correctness by construction, architectural exploration, and meeting the area, timing, and power constraints within standard cell and FPGA frameworks.",
        "features": "Lecture notes",
        "id": "6-884-complex-digital-systems-spring-2005",
        "instructors": "Prof. Chris Terman<br/>(Contributor), Prof. Krste Asanovic, Prof.  Arvind",
        "level": "Graduate",
        "mcn": "6.884",
        "sem": "Spring 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-884-complex-digital-systems-spring-2005/6-884S05-th.jpg",
        "title": "Complex Digital Systems"
    },
    {
        "description": "\nThis course is a graduate level introduction to automatic discourse processing. The emphasis will be on methods and models that have applicability to natural language and speech processing.\nThe class will cover the following topics: discourse structure, models of coherence and cohesion, plan recognition algorithms, and text segmentation. We will study symbolic as well as machine learning methods for discourse analysis. We will also discuss the use of these methods in a variety of applications ranging from dialogue systems to automatic essay writing.\nThis subject qualifies as an Artificial Intelligence and Applications concentration subject.",
        "features": "Selected lecture notes",
        "id": "6-892-computational-models-of-discourse-spring-2004",
        "instructors": "Prof. Regina Barzilay",
        "level": "Graduate",
        "mcn": "6.892",
        "sem": "Spring 2004",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-892-computational-models-of-discourse-spring-2004/6-892s04-th.jpg",
        "title": "Computational Models of Discourse"
    },
    {
        "description": "\nThis course introduces the theory of error-correcting codes to computer scientists. This theory, dating back to the works of Shannon and Hamming from the late 40's, overflows with theorems, techniques, and notions of interest to theoretical computer scientists. The course will focus on results of asymptotic and algorithmic significance. Principal topics include: \n\nConstruction and existence results for error-correcting codes.\nLimitations on the combinatorial performance of error-correcting codes.\nDecoding algorithms.\nApplications in computer science.\n",
        "features": "Selected lecture notes",
        "id": "6-895-essential-coding-theory-fall-2004",
        "instructors": "Prof. Madhu Sudan",
        "level": "Graduate",
        "mcn": "6.895",
        "sem": "Fall 2004",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-895-essential-coding-theory-fall-2004/6-895f04-th.jpg",
        "title": "Essential Coding Theory"
    },
    {
        "description": "\n6.895&nbsp;covers theoretical foundations of general-purpose parallel computing systems, from languages to architecture. The focus is on the algorithmic underpinnings of parallel systems. The topics for the class will vary depending on student interest, but will likely include multithreading, synchronization, race detection, load balancing, memory consistency, routing networks, message-routing algorithms, and VLSI layout theory. The class will emphasize randomized algorithms and probabilistic analysis, including high-probability arguments.\nThis course was also taught as part of the Singapore-MIT Alliance (SMA) programme as course number SMA 5509 (Theory of Parallel Systems).",
        "features": "Selected lecture notes, Projects and examples",
        "id": "6-895-theory-of-parallel-systems-sma-5509-fall-2003",
        "instructors": "Dr. Bradley Kuszmaul, Prof. Charles Leiserson, Prof. Hsu Wen Jing, Prof. Michael Bender",
        "level": "Graduate",
        "mcn": "6.895",
        "sem": "Fall 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-895-theory-of-parallel-systems-sma-5509-fall-2003/6-895f03-th.jpg",
        "title": "Theory of Parallel Systems (SMA 5509)"
    },
    {
        "description": "\n6.896&nbsp;covers mathematical foundations of parallel hardware, from computer arithmetic to physical design, focusing on algorithmic underpinnings. Topics covered include: arithmetic circuits, parallel prefix, systolic arrays, retiming, clocking methodologies, boolean logic, sorting networks, interconnection networks, hypercubic networks, P-completeness, VLSI layout theory, reconfigurable wiring, fat-trees, and area-time complexity.\nThis course was also taught as part of the Singapore-MIT Alliance (SMA) programme as course number SMA 5511 (Theory of Parallel Hardware).",
        "features": "Lecture notes, Assignments and solutions, Exams and solutions",
        "id": "6-896-theory-of-parallel-hardware-sma-5511-spring-2004",
        "instructors": "Dr. Bradley Kuszmaul, Prof. Charles Leiserson, Prof. Michael Bender",
        "level": "Graduate",
        "mcn": "6.896",
        "sem": "Spring 2004",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-896-theory-of-parallel-hardware-sma-5511-spring-2004/6-896s04-th.jpg",
        "title": "Theory of Parallel Hardware (SMA 5511)"
    },
    {
        "description": "\nThis course covers a number of advanced \"selected topics\" in the field of cryptography. The first part of the course tackles the foundational question of how to define security of cryptographic protocols in a way that is appropriate for modern computer networks, and how to construct protocols that satisfy these security definitions. For this purpose, the framework of \"universally composable security\" is studied and used. The second part of the course concentrates on the many challenges involved in building secure electronic voting systems, from both theoretical and practical points of view. In the third part, an introduction to cryptographic constructions based on bilinear pairings is given.",
        "features": "Lecture notes",
        "id": "6-897-selected-topics-in-cryptography-spring-2004",
        "instructors": "Prof. Ran Canetti",
        "level": "Graduate",
        "mcn": "6.897",
        "sem": "Spring 2004",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-897-selected-topics-in-cryptography-spring-2004/6-897s04-th.jpg",
        "title": "Selected Topics in Cryptography"
    },
    {
        "description": "\nThis course examines the role of the engineer as patent expert and as technical witness in court and patent interference and related proceedings. It discusses the rights and obligations of engineers in connection with educational institutions, government, and large and small businesses. It compares various manners of transplanting inventions into business operations, including development of New England and other U.S. electronics and biotechnology industries and their different types of institutions. The course also considers American systems of incentive to creativity apart from the patent laws in the atomic energy and space fields.\nAcknowledgment\nThe instructors would like to thank Joanne Rines and Elijah Ercolino for their efforts in preparing this course.",
        "features": "Assignments (no solutions)",
        "id": "6-931-development-of-inventions-and-creative-ideas-spring-2008",
        "instructors": "Dr. Dedric Carter, Dr. Robert Rines",
        "level": "Graduate",
        "mcn": "6.931",
        "sem": "Spring 2008",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-931-development-of-inventions-and-creative-ideas-spring-2008/6-931s08-th.jpg",
        "title": "Development of Inventions and Creative Ideas"
    },
    {
        "description": "\n6.933J / STS.420J&#160;provides an integrated approach to engineering practice in the real world. Students of 6.933J / STS.420J&#160;research the life cycle of a major engineering project, new technology, or startup company from multiple perspectives: technical, economic, political, and cultural.&#160;Research involves interviewing inventors, reading laboratory notebooks, evaluating patents, and looking over the shoulders of engineers as they developed today's technologies. This subject is for students who recognize that technical proficiency alone is only part of the formula for success in technology.",
        "features": "Projects and examples",
        "id": "6-933j-the-structure-of-engineering-revolutions-fall-2001",
        "instructors": "Prof. David Mindell",
        "level": "Graduate",
        "mcn": "6.933J",
        "sem": "Fall 2001",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-933j-the-structure-of-engineering-revolutions-fall-2001/6-933jf01-th.jpg",
        "title": "The Structure of Engineering Revolutions"
    },
    {
        "description": "\nERBA (ESD.72) emphasizes three methodologies - reliability and probabilistic risk assessment (RPRA), decision analysis (DA), and cost-benefit analysis (CBA). In this class, the issues of interest are: the risks associated with large engineering projects such as nuclear power reactors, the International Space Station, and critical infrastructures; the development of new products; the design of processes and operations with environmental externalities; and infrastructure renewal projects.",
        "features": "Lecture notes",
        "id": "esd-72-engineering-risk-benefit-analysis-spring-2007",
        "instructors": "Prof. George Apostolakis",
        "level": "Graduate",
        "mcn": "ESD.72",
        "sem": "Spring 2007",
        "thumb": "/courses/engineering-systems-division/esd-72-engineering-risk-benefit-analysis-spring-2007/esd-72s07-th.jpg",
        "title": "Engineering Risk-Benefit Analysis"
    },
    {
        "description": "\nThis course covers concepts and techniques for the design and implementation of large software systems that can be adapted to uses not anticipated by the designer. Applications include compilers, computer-algebra systems, deductive systems, and some artificial intelligence applications. Topics include combinators, generic operations, pattern matching, pattern-directed invocation, rule systems, backtracking, dependencies, indeterminacy, memoization, constraint propagation, and incremental refinement. Substantial weekly programming assignments are an integral part of the subject.\nThere will be extensive programming assignments, using MIT/GNU Scheme. Students should have significant programming experience in Scheme, Common Lisp, Haskell, CAML or some other \"functional\" language.",
        "features": "Projects (no examples), Assignments (no solutions)",
        "id": "6-945-adventures-in-advanced-symbolic-programming-spring-2009",
        "instructors": "Prof. Gerald Sussman",
        "level": "Graduate",
        "mcn": "6.945",
        "sem": "Spring 2009",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-945-adventures-in-advanced-symbolic-programming-spring-2009/6-945s09-th.jpg",
        "title": "Adventures in Advanced Symbolic Programming"
    },
    {
        "description": "\nWe will study the fundamental principles of classical mechanics, with a modern emphasis on the qualitative structure of phase space. We will use computational ideas to formulate the principles of mechanics precisely. Expression in a computational framework encourages clear thinking and active exploration.\nWe will consider the following topics: the Lagrangian formulation; action, variational principles, and equations of motion; Hamilton's principle; conserved quantities; rigid bodies and tops; Hamiltonian formulation and canonical equations; surfaces of section; chaos; canonical transformations and generating functions; Liouville's theorem and Poincar&eacute; integral invariants; Poincar&eacute;-Birkhoff and KAM theorems; invariant curves and cantori; nonlinear resonances; resonance overlap and transition to chaos; properties of chaotic motion.\nIdeas will be illustrated and supported with physical examples. We will make extensive use of computing to capture methods, for simulation, and for symbolic analysis.",
        "features": "",
        "id": "12-620j-classical-mechanics-a-computational-approach-fall-2008",
        "instructors": "Prof. Gerald Sussman, Prof. Jack Wisdom",
        "level": "Graduate",
        "mcn": "12.620J",
        "sem": "Fall 2008",
        "thumb": "/courses/earth-atmospheric-and-planetary-sciences/12-620j-classical-mechanics-a-computational-approach-fall-2008/12-620jf08-th.jpg",
        "title": "Classical Mechanics: A Computational Approach"
    },
    {
        "description": "\nThis course provides intensive coverage of the theory and practice of electromechanical instrument design with application to biomedical devices. Students will work with MGH doctors to develop new medical products from concept to prototype development and testing. Lectures will present techniques for designing electronic circuits as part of complete sensor systems. Topics covered include: basic electronics circuits, principles of accuracy, op amp circuits, analog signal conditioning, power supplies, microprocessors, wireless communications, sensors, and sensor interface circuits. Labs will cover practical printed circuit board (PCB) design including component selection, PCB layout, assembly, and planning and budgeting for large projects. Problem sets and labs in the first six weeks are in support of the project. Major team-based design, build, and test project in the last six weeks. Student teams will be composed of both electrical engineering and mechanical engineering students.",
        "features": "Lecture notes",
        "id": "2-996-biomedical-devices-design-laboratory-fall-2007",
        "instructors": "Dr. Hongshen Ma",
        "level": "Graduate",
        "mcn": "2.996",
        "sem": "Fall 2007",
        "thumb": "/courses/mechanical-engineering/2-996-biomedical-devices-design-laboratory-fall-2007/2-996f07-th.jpg",
        "title": "Biomedical Devices Design Laboratory"
    },
    {
        "description": "\nThis research-oriented course will focus on algebraic and computational techniques for optimization problems involving polynomial equations and inequalities with particular emphasis on the connections with semidefinite optimization. The course will develop in a parallel fashion several algebraic and numerical approaches to polynomial systems, with a view towards methods that simultaneously incorporate both elements. We will study both the complex and real cases, developing techniques of general applicability, and stressing convexity-based ideas, complexity results, and efficient implementations. Although we will use examples from several engineering areas, particular emphasis will be given to those arising from systems and control applications.",
        "features": "Lecture notes",
        "id": "6-972-algebraic-techniques-and-semidefinite-optimization-spring-2006",
        "instructors": "Prof. Pablo Parrilo",
        "level": "Graduate",
        "mcn": "6.972",
        "sem": "Spring 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-972-algebraic-techniques-and-semidefinite-optimization-spring-2006/6-972s06-th.jpg",
        "title": "Algebraic Techniques and Semidefinite Optimization"
    },
    {
        "description": "\nThis course presents a top-down approach to communications system design. The course will cover communication theory, algorithms and implementation architectures for essential blocks in modern physical-layer communication systems (coders and decoders, filters, multi-tone modulation, synchronization sub-systems). The course is hands-on, with a project component serving as a vehicle for study of different communication techniques, architectures and implementations. This year, the project is focused on WLAN transceivers. At the end of the course, students will have gone through the complete WLAN System-On-a-Chip design process, from communication theory, through algorithm and architecture all the way to the synthesized standard-cell RTL chip representation. ",
        "features": "Selected lecture notes, Assignments and solutions, Exams (no solutions)",
        "id": "6-973-communication-system-design-spring-2006",
        "instructors": "Prof. Vladimir Stojanovic",
        "level": "Graduate",
        "mcn": "6.973",
        "sem": "Spring 2006",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-973-communication-system-design-spring-2006/6-973s06-th.jpg",
        "title": "Communication System Design"
    },
    {
        "description": "\nThe course examines optical and electronic processes in organic molecules and polymers that govern the behavior of practical organic optoelectronic devices. Electronic structure of a single organic molecule is used as a guide to the electronic behavior of organic aggregate structures. Emphasis is placed on the use of organic thin films in active organic devices including organic LEDs, solar cells, photodetectors, transistors, chemical sensors, memory cells, electrochromic devices, as well as xerography and organic non-linear optics. How to reach the ultimate miniaturization limit of molecular electronics and related nanoscale patterning techniques of organic materials will also be discussed. The class encompasses three laboratory sessions during which the students will practice the use of select vacuum and non-vacuum organic deposition techniques by making their own active organic devices.",
        "features": "Lecture notes",
        "id": "6-973-organic-optoelectronics-spring-2003",
        "instructors": "Prof. Vladimir Bulovic",
        "level": "Graduate",
        "mcn": "6.973",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-973-organic-optoelectronics-spring-2003/6-973s03-th.jpg",
        "title": "Organic Optoelectronics"
    },
    {
        "description": "The course presents an in-depth interdisciplinary perspective of electric power systems, with regulation providing the link among the engineering, economic, legal and environmental viewpoints. Generation dispatch, demand response, optimal network flows, risk allocation, reliability of service, renewable energy sources, ancillary services, tariff design, distributed generation, rural electrification, environmental impacts and strategic sustainability issues will be among the topics addressed under both traditional and competitive regulatory frameworks.",
        "features": "Selected lecture notes, Assignments (no solutions)",
        "id": "esd-934-engineering-economics-and-regulation-of-the-electric-power-sector-spring-2010",
        "instructors": "Prof. Ignacio Perez-Arriaga",
        "level": "Graduate",
        "mcn": "ESD.934",
        "sem": "Spring 2010",
        "thumb": "/courses/engineering-systems-division/esd-934-engineering-economics-and-regulation-of-the-electric-power-sector-spring-2010/esd-934s10-th.jpg",
        "title": "Engineering, Economics and Regulation of the Electric Power Sector"
    },
    {
        "description": "This course aims to give students the tools and training to recognize convex optimization problems that arise in scientific and engineering applications, presenting the basic theory, and concentrating on modeling aspects and results that are useful in applications. Topics include convex sets, convex functions, optimization problems, least-squares, linear and quadratic programs, semidefinite programming, optimality conditions, and duality theory. Applications to signal processing, control, machine learning, finance, digital and analog circuit design, computational geometry, statistics, and mechanical engineering are presented. Students complete hands-on exercises using high-level numerical software. Acknowledgements The course materials were developed jointly by Prof. Stephen Boyd (Stanford), who was a visiting professor at MIT when this course was taught, and Prof. Lieven Vanderberghe (UCLA).",
        "features": "Lecture notes, Assignments (no solutions), Exams (no solutions)",
        "id": "6-079-introduction-to-convex-optimization-fall-2009",
        "instructors": "Prof. Stephen Boyd, Prof. Pablo Parrilo",
        "level": "Undergraduate",
        "mcn": "6.079",
        "sem": "Fall 2009",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-079-introduction-to-convex-optimization-fall-2009/6-079f09-th.jpg",
        "title": "Introduction to Convex Optimization"
    },
    {
        "description": "\n6.976 covers circuit and system level design issues of high speed communication systems, with primary focus being placed on wireless and broadband data link applications. Specific circuit topics include transmission lines, high speed and low noise amplifiers, VCO's, and high speed digital circuits. Specific system topics include frequency synthesizers, clock and data recovery circuits, and GMSK transceivers. In addition to learning analysis skills for the above items, students will gain a significant amount of experience in simulating circuits in SPICE and systems in CppSim (a custom C++ simulator).",
        "features": "Selected lecture notes, Projects (no examples), Assignments (no solutions), Exams (no solutions)",
        "id": "6-976-high-speed-communication-circuits-and-systems-spring-2003",
        "instructors": "Prof. Michael Perrott",
        "level": "Graduate",
        "mcn": "6.976",
        "sem": "Spring 2003",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-976-high-speed-communication-circuits-and-systems-spring-2003/6-976s03-th.jpg",
        "title": "High Speed Communication Circuits and Systems"
    },
    {
        "description": "\nThis course is offered to graduate students and addresses issues regarding ultrafast optics. Topics covered include: Generation, propagation and applications of ultrashort pulses (nano-, pico-, femto-, attosecond pulses); Linear and nonlinear pulse shaping processes: Optical solitons, Pulse compression; Laser principles:  Single- and multi-mode laser dynamics, Q-switching, Active and passive mode-locking; Pulse characterization: Autocorrelation, FROG, SPIDER; Noise in mode-locked lasers and its limitations in measurements; Laser amplifiers, optical parametric amplifiers, and oscillators; Applications in research and industry: Pump-probe techniques, Optical imaging, Frequency metrology, Laser ablation, High harmonic generation.",
        "features": "Online textbooks, Assignments (no solutions)",
        "id": "6-977-ultrafast-optics-spring-2005",
        "instructors": "Prof. Franz Kärtner",
        "level": "Graduate",
        "mcn": "6.977",
        "sem": "Spring 2005",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-977-ultrafast-optics-spring-2005/6-977s05-th.jpg",
        "title": "Ultrafast Optics"
    },
    {
        "description": "\n6.977 focuses on the physics of the interaction of photons with semiconductor materials. The band theory of solids is used to calculate the absorption and gain of semiconductor media. The rate equation formalism is used to develop the concepts of laser threshold, population inversion and modulation response. Matrix methods and coupled mode theory are applied to resonator structures such as distributed feedback lasers, tunable lasers and microring devices. The course is also intended to introduce students to noise models for semiconductor devices and to applications of optoelectronic devices to fiber optic communications. This course is worth 12 Engineering Design points.",
        "features": "",
        "id": "6-977-semiconductor-optoelectronics-theory-and-design-fall-2002",
        "instructors": "Prof. Rajeev Ram",
        "level": "Graduate",
        "mcn": "6.977",
        "sem": "Fall 2002",
        "thumb": "/courses/electrical-engineering-and-computer-science/6-977-semiconductor-optoelectronics-theory-and-design-fall-2002/6-977f02-th.jpg",
        "title": "Semiconductor Optoelectronics: Theory and Design"
    },
    {
        "description": "\nThis course provides an introduction to the technology and policy context of public communications networks, through critical discussion of current issues in communications policy and their historical roots. The course focuses on underlying rationales and models for government involvement and the complex dynamics introduced by co-evolving technologies, industry structure, and public policy objectives. Cases drawn from cellular, fixed-line, and Internet applications include evolution of spectrum policy and current proposals for reform; the migration to broadband and implications for universal service policies; and property rights associated with digital content. The course lays a foundation for thesis research in this domain. ",
        "features": "Selected lecture notes",
        "id": "esd-68j-communications-and-information-policy-spring-2006",
        "instructors": "Dr. David D. Clark, Dr. Frank Field,  Sharon E. Gillett, Dr. William Lehr",
        "level": "Graduate",
        "mcn": "ESD.68J",
        "sem": "Spring 2006",
        "thumb": "/courses/engineering-systems-division/esd-68j-communications-and-information-policy-spring-2006/esd-68js06-th.jpg",
        "title": "Communications and Information Policy"
    },
    {
        "description": "This participatory seminar focuses on the knowledge and skills necessary for teaching science and engineering in higher education. This course is designed for graduate students interested in an academic career, and anyone else interested in teaching. Topics include theories of adult learning; course development; promoting active learning, problem-solving, and critical thinking in students; communicating with a diverse student body; using educational technology to further learning; lecturing; creating effective tests and assignments; and assessment and evaluation. Students research and present a relevant topic of particular interest. The subject is appropriate for both novices and those with teaching experience.",
        "features": "This Course at MIT",
        "id": "5-95j-teaching-college-level-science-and-engineering-fall-2012",
        "instructors": "Dr. Janet Rankin",
        "level": "Graduate",
        "mcn": "5.95J",
        "sem": "Fall 2012",
        "thumb": "/courses/chemistry/5-95j-teaching-college-level-science-and-engineering-fall-2012/5-95jf12-th.jpg",
        "title": "Teaching College-Level Science and Engineering"
    },
    {
        "description": "This participatory seminar focuses on the knowledge and skills necessary for teaching science and engineering in higher education. This course is designed for graduate students interested in an academic career, and anyone else interested in teaching. Readings and discussions include: teaching equations for understanding, designing exam and homework questions, incorporating histories of science, creating absorbing lectures, teaching for transfer, the evils of PowerPoint, and planning a course. The subject is appropriate for both novices and those with teaching experience.",
        "features": "Selected video lectures, Faculty introduction - video, Subtitles/transcript, Assignments (no solutions)",
        "id": "5-95j-teaching-college-level-science-and-engineering-spring-2009",
        "instructors": "Prof. Sanjoy Mahajan",
        "level": "Graduate",
        "mcn": "5.95J",
        "sem": "Spring 2009",
        "thumb": "/courses/chemistry/5-95j-teaching-college-level-science-and-engineering-spring-2009/5-95js09-th.jpg",
        "title": "Teaching College-Level Science and Engineering"
    }
]